["For Sunday Church Communions, Chuck Norris is served a 3 lb loaf or sourdough bread and gallon jug of MD 20/20 wine.","If a fishes see Chuck Norris swim , they usally drown in fear.","The signs outside of Chuck Norris' properties all say \"TRESPASSERS WILL BE NORRISED\"","For a birthday prank, Chuck Norris put a gorilla's head on Francis Ford Coppola's bed while he was sleeping.","Chuck Norris created Stephen Hawking during a bowel movement,","Chuck Norris' derringer can fire a 30 round clip of 12 ga rifled slugs.","For some people, waering a beard of bees is considered a great accomplishment. Chuck Norris routinely wears pants, jockstraps and condoms of wasps.","When Chuck Norris plays Five Nights at Freddy's, the animatronics don't get him. The animatronics come to him.","Chuck Norris can smother a whale with a cue tip.","If you are female, and you are reading this, Chuck Norris just fucked you and erased your memory when you read the word 'fucked'. And again, just then. Fuck, sorry.","Chuck Norris can count the ABC","Brokeback Mountain is not just a film. It's also what Chuck Norris calls the pile of dead ninjas is his backyard.","He, Chuck Norris, is awesome!!!","Mother Nature and Father Time came together and made Chuck Norris, But his name wasn`t always Chuck norris because it`s latin for I WILL KICK YOUR ASS.","If Chuck Norris played baseball, the Texas Rangers would have won the World Series in 2011.  And 2010.  And every Series dating back to 1972, their first year in Texas.","Chuck Norris is older than his own dad.","Little known fact: Chuck Norris was a massive Doors fan, and for a while used to insist on being called Chuck Norrison. Then he heard that the singer moved to France, then scared him to death in the bathtub.","Men are from Mars, women are from Venus... and yes, damn right Chuck Norris has a massive penis.","Chuck Norris doesnt Shit bricks, he shits full size buildings, hence the invention of the Pre-Fabricated homes.","Chuck Norris now lives in Eagle Pass. He has a set of balls made out of brass. When they clang together, They cause stormy weather. And lighting shoots out of his ass.","Chuck Norris doesn't want to build a snowman.","Harry potter is chuck Norris's love child","Chuck Norris invented spectacles so even short-sighted people could see how brilliant he is.","Out puts Chuck Norris.","If the Dos Equis guy were to pat you on the back, you would list it on your resume. If Chuck Norris were to pat you on the back, you would die.","Chuck Norris can literally kick a person's ass into next week. Their head will travel five days farther.","If Chuck Norris says that turkey, cranberries & yams actually taste real good, then they do!!! And out of fear, that's the only reason we we eat that crap. We are truely Thankful that Chuck Norris only demands this once a year.","Chuck Norris owns the trademark on both the 70's and the 80's.","Chuck Norris' fairy godparents do not use \"Da Rules book\". He can wish for anything he wants no matter if its bad or not.","Jesus wears a WWCND (what would Chuck Norris do) bracelet.","Whitney Houston was recently found dead in a Hotel room with drugs all around her body. She overdosed once she found out Chuck Norris was actually her father.","911 happened when Chuck Norris threw a paper airplane","Superman has a pair of Chuck Norris pajamas.","Chuck Norris can shine his boots to perfection just by using his foot and your ass.","If Superman and The Flash had a race to the end of the world, Chuck Norris would be the winner.","Chuck Norris remembers 9-11. He bows to the real American heroes on this day. And to America. And most importantly the families of all the fallen on that day 10 years ago. And to all the US servicemen & women who fell and to those who have served and those that continue to serve. And so do I!!!","Chuck Norris invented time, so people know when theirs is up.","Chuck Norris doesn't do push-ups he just pushes the earth down.","Some creatures fatally confuse Chuck Norris' beard with a rain forrest.","Chuck Norris threw his first paper aeroplane age 4... It landed yesterday.","Chuck Norris participated in the Running of The Bulls but was banned from ever doing it again. All the bulls ran from Chuck and wouldn't come back.","It was Chuck Norris who taught Mongo, of the \"Blazing Saddles\" movie fame, how to proerly light a cigar.","Chuck Norris never cheats on his wives. The word 'cheat' would imply that they didn't know Chuck's deal going in.","In 1969, man landed on the Moon. By 1969, Chuck Norris had already landed on eight planets, skipping Pluto \"because it's too damn small.\"","The only thing Chuck Norris has lost is his virginity.","I hate Chuck Norris! And now I'm dead in 2 seconds","Chuck Norris can literally hand you your ass in a handbag. And then pull it out and kick it up between your ears.","Chuck Norris can believe it's not butter.","Chuck Norris wanted to fight someone and wanted a challege, so he cloned himself. The resulting fight is now known as the big bang. Chuck Norris won.","People who enjoy being green are known as \"tree huggers\". People who enjoy living are known as Chuck Norris huggers.","Chuck Norris is the inventor of the drive-by threesome.","Chuck Norris actually ghost wrote all of Ernest Hemingway's novels and taught him the virtues of Key West fishing, rum drinking at Sloppy Joe's & whores.","Chuck Norris sired a baseball team...and a football team if you count all of the bastards.","Crop circles are Chuck Norris' way of telling the world that sometimes corn needs to lie down.","Not everyone that Chuck Norris is mad at gets killed. Some get away. They are called astronauts.","Chuck Norris has a roundhouse-kick app for his iPhone &#8734;.0","Teenage Mutant Ninja Turtles is based on a true story: Chuck Norris once swallowed a turtle whole, and when he crapped it out, the turtle was six feet tall and had learned karate.","Chuck Norris' organ donor card also includes his beard.","Chuck Norris doesn't chew gum he chews diamonds","All roads lead to Chuck Norris. And by the transitive property, a roundhouse kick to the face.","After Chuck Norris takes a dump, he sprays his bathroom with a can of Glade Floral Spray. That helps and makes it only smell like a hippopotamus took a shit in a flower garden.","If Chuck Norris was the lead actor of Mission Impossible, the movie would've lasted 1 minute.","Chuck Norris wrote & owns copyrights of the song, \"Happy Birthday\"","Chuck Norris can exhale a huge plume of cigar smoke at any time.","When playing Blackjack, Chuck Norris wears a 50-gallon cowboy hat, huge bug-eye wraparound shades and a black velvet leisure suit covered in diamond studs. He keeps a loaded Uzi on the table while he plays.","Jesus is the only person in history who was not killed by Chuck Norris; when Chuck Norris kills someone, they stay dead.","When Chuck Norris owns an Xbox 360 It never had the three rings of death because it's afraid of Chuck Norris.","Once, while tooling around in his Delorean, Chuck Norris accidentally went 4.5 billion years into the past. Before returning to the present, he hocked a wad of phlegm out the window. And that is how all life on earth began.","By the time you finish reading this 9,000 people will have been murdered by Chuck Norris. :D","Chuck Norris owns property in the Uncanny Valley","When Chuck Norris was 5, he went to the Mall to see Santa. Santa asked \"what would you like little boy, a train set? A bike? Chuck replied \"no Santa, I want a rocket launcher\".","Chuck Norris can make you piss your soul.","Chuck Norris knows you currently have a pornographic website minimised on the screen.","Chuck Norris is actually the front man for Apple. He lets Steve Jobs run the show when he's on a mission. Chuck Norris is always on a mission.","Iron Maiden was Iron Man before Chuck Norris got a hold of them!","Upon leaving a public swimming pool, Chuck Norris then urinates in it.","Chuck Norris once threw a Kenworth into the Pacific Ocean. It became known as Octopus Prime.","Jesus can walk on water. Chuck Norris can walk on Jesus.","A mere glimpse of Chuck Norris bearded member gave engineers the idea for the Alaska Pipeline.","When Chuck Norris goes to a strip club, the strippers pay him before their performances.","Chuck Norris can Supercharge an electric car.","Chuck Norris wishes you a Merry Christmas, a Happy Hannukah, and a Happy New Year... so you better have one!","You can see Chuck Norris's charisma from space.","Chuck Norris can tell a 'yo mama' joke that is so perfect, your head will explode.","Chuck Norris' dinner guests often throw up in their mouths, to savor his fine cooking all over again.","Depending on the circumstances, Chuck Norris will decide whether or not his farts will stink. If he chooses to have them stink, he will then also choose the percentage level of rankness appropriate for the attending audience.","If you receive an invitation from Chuck Norris to attend a Texas Tea Party rally, it is actually his secret code for you to come over for a fun filled evening of jello shooters, beer pong & strip poker.","All browsers support the hex definitions #chuck and #norris for the colors black and blue.","If Chuck Norris coughs on you, you owe him 50 bucks.","Chuck Norris invented Spam.","Chuck Norris can whistle in sign language.","Chuck Norris once saw Spiderman on a wall so he folded up a newspaper and swatted him.","Chuck Norris is the only man who has hit 5 home runs while playing in the Super Bowl.","Girls program in VB, men program in C, macho men program in Java, but Chuck Norris programs with voltage levels.","The International Monetary Fund is in debt to Chuck Norris","Jason didn't drown Chuck Norris pulled him under","Chuck Norris' \"little black book\" was recently used by the Texas government to compile their last phone directory.","Who let Chuck Norris out?Who,who,who?...ofcourse Chuck Norris!","Every February 2nd, Chuck Norris sees his shadow and beats the hell out of it.","Chuck Norris got his legs cut off and still managed to get up and walk it off.","CHUCK NORRIS IS THE REASON HITLER KILLED HIMSELF. HE KNEW HE COULD NOT TAKE OVER THE WORLD WITH HIM STILL IN IT. NOBODY CAN TELL CHUCK WAT TO DO.","The fumes from a Chuck Norris fart can make Limburger Cheese smell a perfume factory.","Albert Einstein's hair used to be neatly combed...until the day he met Chuck Norris.","Chuck Norris has eyes in the back of YOUR head","Chuck Norris once did a hippy chick. Their lovechild is Captain Planet.","Chuck Norris deflowered and impregnated 14 young women on his wedding day.","Chuck Norris is the reaso Waldo is hiding.","Chuck Norris once donated a pint of blood to a cancer patient. We know that cancer patient now as Superman.","Bruce Spingsteen calls Chuck Norris \"The Boss\".","Bill Gates thinks he's Chuck Norris. Chuck Norris actually laughed. Once.","Chuck Norris and the Terminator recently ran into each other. The Terminator asked \"what's up, boss\"?","Chuck Norris is your father!","Chuck Norris can dicieve his own mind!","Chuck Norris can outrun an Olympic sprinter. By walking.","Chuck Norris is the 1st playboy playmate","Chuck Norris can watch DVDs in a VCR player.","Texas Tea - Chuck Norris sweat","The Chuck Norris-approved Chucknopoly is the world's only board game that is potentially fatal.","Chuck Norris used Thor's hammer to tack a picture up on his living room wall.","Chuck Norris shot the sheriff. And he shot the deputy.","Grandma got run over by a reindeer. Then Chuck Norris finished her off by running over her in his Hummer.","Do you know why Diablo 3 delayed over and over again? Because Diablo is too scared of Chuck Norris.","In the year 1873, the then world super power Albertania waged a war against Chuck Norris. No one has heard about Albertania ever since.","Somebody was lighting up a Marley just as Chuck Norris cut a fart aboard the Hindenburg.","Chuck Norris once beat someone to death with water.","Chuck Norris once round house kicked a retarded kids bus, and it became the first smart car.","The most beautiful and lush chord ever heard by the human ear is created by Chuck Norris simply dropping his dick onto a piano keyboard.","Chuck norris doesnt use the force he is the force","Chuck Norris dosen't obey WeeGee.WeeGee obeys Chuck Norris","Chuck Norris once beat the entire New York jets football team by himself. And every play he ran was a punt!","why isnt pisa straight up? i think it is Chuck Norris who....","The 11th commandment is ?Thou shalt not piss off Chuck Norris? This commandment is rarely enforced, as it is impossible to accomplish.","When Chuck Norris found out his daughter lost her virginity, he went and got it back.","Rain never used to exist before Chuck Norris began shouting at clouds to reveal their true nature.","Chuck Norris uses custom-made button-fly denim condoms.","Chuck Norris doesn't drive, because all roads lead to Chuck Norris.","Over the years, Chuck Norris has had thousands of tattoos, but because of his healing factor they usually fade within a few hours. He just sometimes likes to impress his dates by getting big sleeves, back-tatts and a '666' on his forehead.","Chuck Norris always puts a coaster under his Uzi.","When WeeMan joined the cast of Jackass, he was 6'1 1/2\" tall. Then they had him try to give Chuck Norris a wedgie.","A Chuck Norris flying roundhouse kick to the buttocks has been known to cause an infected, yellow pus filled abscess in hemorrhoidal tissue.","once, while having sex in a tractor trailer, a drop of Chuck Norris's sperm escaped into the motor.....we now know this truck as Optimus Prime!","Chuck Norris is the only guy in a nudist colony who can carry two cups of coffee and nine donuts.","Chuck Norris never \"raises the roof\". he lowers the floor.","Chuck Norris doesn't go to the gas station. Chuck Norris goes to Jurassic Park.","Chuck Norris sensed a great disturbance in the force. Then he laughed, because he realised it was himself.","Chuck Norris uses a live elephant's scortum as a punching bag.","If Chuck Norris wore pink bunny slippers, it would be queer not to wear them.","Chuck Norris is what ancient Greeks used to protect their mazes.","The Grand Canyon was caused by Chuck Norris pissing there--Once.","Chuck norris shaves his balls with a chainsaw","No one truly knows who's Chuck Norris' real father. No one is biologically strong enough for this. He must've conceived himself.","Chuck Norris tells Scorpian to \"get over Here\"","They once made a Chuck Norris toilet paper, but it wouldn't take shit from anybody.","Chuck Norris can get road rage in a fighter jet.","Chuck Norris does not floss his teeth, he merely clenches them and blows out real hard in bursts for a minute. The resulting Chuck Norris teeth-product is collected and used as fertilizer by farmers in Taiwan.","Chuck Norris' mother wears bowling ball earrings.","Mick Jagger: \"oh you can't always get what you waaaannt.\"  Chuck Norris \"Yes I can.\"","Chuck Norris getting his ass kicked is as likely as seeing a vampire with a suntan.","Chuck Norris can see around corners.","It is better to give than to receive. This is especially true of a Chuck Norris roundhouse kick.","Chuck Norris once destroyed a city to prove a point When asked Chuck Norris said The point was That I can destroy a city.","The fatalities in Mortal Kombat are just reenactments of Chuck Norris going ape shit durring a traffic jam.","Chuck Norris once ran 3857689753872893687 kilometers in 0.000000001 seconds in wet cement while pulling a 783769718-wheeler truck full of 75939284869686 cubic meters of very heavy objects. [insert the phrase \"over 9000!\" many times here, please]","Even at 70, Chuck Norris still ain't too old for this shit.","Everyone knew the world was flat,but they especially didn't want sail around the world because they knew if they fell then Chuck Norris would roundhouse kick them.","Simply by visiting this website, Chuck Norris now knows your full name, address, occupation, what you look like and how often you masturbate.","Big Foot claims he has a couple pictures of Chuck Norris... All his friends think he's full of crap.","if a tree falls in the forest and Chuck Norris is around does he make a sound when he is killing your family","Chuck Norris' tongue is actually an atypical proboscis which he has adapted to absorb the last few drops of liquid & foam from the bottom of his beer cans.","Chuck Norris never liked the Phillippines. Especially Tacloban.","Chuck Norris can drive manual, in an automatic.","Chuck Norris is a pacifist. He can pass-a-fist through your face.","Chuck Norris' penis is so massive that kids lose baseballs and frisbees on it","Chuck Norris once stayed at the Hotel California and was allowed to check out...and leave.","Chuck Norris scared the Black out of Eminem.","The back of Chuck Norris' hands are always speckled with bone marrow.","Chuck Norris is the only person on earth who can get a quadruple-word score at Scrabble.","Chuck Norris can do donuts in a steam train","Chuck Norris' breath always smells like pussy. Always.","Chuck Norris' iPad has flash.","\"We will never know how brave Chuck Norris till we discover something in the universe that Chuck Norris is actually afraid of.\" - Socrates  Socrates didn't die a natural death.","Chuck Norris is who the lead singer of The Divynals thinks about when she touches herself.","Chuck Norris can win a marathon hopping backward on one foot and pulling a brigade of tanks.","Chuck Norris can pluck out individual Hydrogen and Oxygen atoms from a water molecule.","Chuck Norris' favorite cereal is Kellogg's Nails 'N' Gravel.","Chuck Norris can talk backwards. In Chinese.","SNAKE PLISSKIN MAKES CHUCK NORRIS LOOK LIKE A SCHOOL GIRL BABY BACK BITCH !!!!!!","Chuck Norris is so American, he eats tyranny and shits apple pie.","Curators at Madame Tussauds Wax Museum had to remove the life size wax figure of Chuck Norris one day after they first installed it. It seems they found Chuck Norris' wax foot deeply inbedded in the face of the Michael Jackson figure.","In museums, Chuck Norris is allowed to touch the artifacts.","Chuck Norris does not fart. Because his fart can annihilate all life forms on Earth. But on December 21st 2012, he MAY fart.","Chuck Norris is suing the Korean pop singer PSY for copyright infringement on the phrase Gangnam Style and the horse riding dance","Chuck Norris doesn't bend the truth, he snaps its' neck.","pearld harbour was burned because Chuck Norris pee on that with high explosive urine","The last time Chuck Norris used the term \"clean up this mess\" it rained for 40 days and 40 nights.","It isn't what Chuck Norris would do for a Klondike bar, but more so, what a Klondike bar would do for Chuck Norris","There are only three things in the world that are a sure kill. 1. Kirby's Super Inhale. 2. Captain Falcon's Falcon Punch. 3. Chuck Norris's Roundhouse Kick.","There are two types of people in the world: those who have been killed by Chuck Norris, and those who will be.","If Chuck Norris is late, time better slow the fuck down.","Brahma bulls are envious of the size of all three of Chuck Norris' testicles.","the fountain of youth is actually Chuck Norris' lavatory","Chuck Norris tells black jokes without looking over his shoulder","Chuck Norris' motto: \"The difficult I do immediately. The impossible takes 3 seconds longer\".","Chuck Norris once threw a hand grenade into a crowd of 50 people , killing everyone of them.....then the grenade went off.","Chuck Norris killed the Earl of Sandwich and ate the fillets between two loaves of bread.","Chuck Norris invented the yellow brick road.","Chuck Norris invented the word \"kill\" as well as other words like \"die\", \"beer\" and \"cunnilingus\".","EVERY DAY I'M SHUFFLIN'... - CHUCK NORRIS","Chuck Norris decided he needed to have a pet. He looked at dogs and cats then ended up getting a pet alligator named Fluffy.","They once made a Chuck Norris toilet paper, but it wouldn't take shit from anybody.","Chuck Norris doesn't bend light.... he breaks it.","Chuck Norris has counted to infinity and negative infinity, mutliple times, while waiting in line at the DMV.","Chuck Norris knows 28 words in 32 distinct languages that rhyme with orange.","Chuck norris ate a 72lb steak in 60 minutes  He spent the firs 55 fucking the waitress","Having a tick on the head of your dick is better than receiving a Chuck Norris roundhouse kick in your neck.","A Chuck Norris beating is tax-deductable.","The arc of triumph in Paris is Chuck Norris cock-ring.","Chuck Norris' beard survives by absorbing other beards.","Just one Spinning Backfist Punch by Chuck Norris will make your liver quiver and your spleen scream.","Guns don't kill people. Chuck Norris kills people.","Chuck Norris irons his clothes by wearing them.","Chuck Norris smokes rolled-up newspapers.","Chuck Norris can drive two cars at the same time!!","Little miss muffet sat on her tuffet, until Chuck Norris roundhouse kicked her into an iceberg","Chuck Norris can do donuts in a steam train","Nothing is more American than apple pie. This is not true. Nothing is more ANYTHING than Chuck Norris.","Chuck Norris doesnt wear a watch, HE decides what time it is.","President Roosevelt once rode his horse 100 miles. Chuck Norris carried his the same distance in half the time.","At the dawn of time, Chuck Norris and Mr. T sat in an empty universe, bored with nothing to destroy, so they decided to arm wrestle.  The competition began - it raged on for days and days, with thunderclaps of pure energy jolting off of their bulging muscles, ripping holes through reality, and creating the universe as we know it.  Finally, after much-ado, and with one emphatic thud, Mr. T beat Chuck Norris at arm wrestling...  ...And thus, Chuck Norris invented racism, and roundhouse kicked Mr. T into a bad 1980's TV show.","Chuck Norris is the reason why Oscar the Grouch is in a trash can.","The last digit of pi is Chuck Norris. He is the end of all things.","Chuck Norris has the world's most famous taint.","Chuck Norris was recently on Oprah, and while discussing his sexual conquests of Katie Holmes behind Tom Cruise's back, he got overexcited on jumped all over the audience.","When a telemarketer phones Chuck Norris' number, the first thing they hear is the pleading voice of one their loved ones.","Chuck Norris' Penis is a third degree blackbelt, and an honorable 32nd-degree mason.","When the Terminator goes to the cinema, he watches only Chuck Norris movies.","Why did the chicken cross the road? Because it was afraid to be on the same side as Chuck Norris.","Chuck Norris would like to be / under the sea / in an octopus's garden / throttling Ringo","Chuck Norris threw a grenade, killed 50 pople, then the grenade exploded.","The only type of fever Chuck Norris ever gets is disco fever.","When Chuck Norris rips you a new one, it is actually anatomically superior to your old one. You must thank Lord Norris.","the 3 blind mice may have rang all the bells in the church Chuck Norris rang all the bells in america the snap of his fingers then he got an award for rape","Chuck Norris can invite you to your own birthday party.","Reportedly, the moment Chuck Norris was born, Hitler's actual jaw spontaneously dislocated.","The USA is now the CNC [Chuck Norris Country]. Lawl did you really think i was Chuck Norris? no, im that \"...\" guy trololololololoftjhdlshkgksejeklnadjsuehukdkjfdlxgijhjwvddkDARN NOT AGAINhgjfsncdjcndchcnuckjhkxzsgk","Burger King once tried to sue Chuck Norris for copy write infringment because he has a sign on his front gate that says \"Home of the Whopper\". They lost","Chuck Norris has the world's largest baculum. Don't know what that is? Look it up.","Chuck Norris can make a cheeseburger without cheese","Chuck Norris puts the \"ouch\" in couch.","The U2 song \"Sunday Bloody Sunday\" was written to depict the day of the week when Chuck Norris has sex with Irish women.","Chuck Norris oncd spent his entire weekend eating Duracell Batteries. He did this so that on Monday he could crap out a fire-developed tank round to fire at the short bus that drives by his house. He then give the bus a roundhouse kick to the face!","Chuck Norris can retract his beard, wolverine-style, at will. It makes that metallic sound and everything.","Chuck Norris has a reputation not to be sneered at. Seriously, don't sneer at him. You'll get a boot to the kidneys.","The Chuck Norris military unit was not used in the game Civilization 4, because a single Chuck Norris could defeat the entire combined nations of the world in one turn.","Chuck Norris doesn't have to pay $4.00 a gallon for gas. His vehicle is too frightened to ever run out.","By the time you finish reading this 9,000 people will have been murdered by Chuck Norris. :D","When Chuck Norris kills yo mamma don't cry he was just telling her he likes her sweater in karate","Chuck Norris can chokeslam anybody with both of his hands tied behind his back","Simply whispering 'Chuck Norris' into a woman's ear gives you a 20 percent chance of nailing her.","Ladies put the toilet seat back up for Chuck Norris.","Chuck Norris was not made by god.God was made by Chuck Norris","the movie \"dont mess with zohan\" is based on the true story of Chuck Norris' life","Chuck Norris can submerge himself in water and come out dry.","Chuck Norris once screamed \"bloody murder\" in sign language for the hearing impaired.","Chuck Norris will not be in The Expendables 3 simply because Stallone never wants to feel that terrified again.","Chuck Norris was orginally casted as the main character for salt but then they changed it to Angelia Jolie, look at her face now.","When Chuck Norris was a bartender he invented a drink called the \"Colon Slammer\". It was made with Vodka and Prune juice.","Chuck Norris is the reason why the words \"Bad\" and \"Ass\" came together","Chuck Norris was once caught without a ticket on the train. The inspector was fined $110.","Q: How much wood could a woodchuck chuck if a woodchuck could Chuck Norris? A: All of it...","The Colosseum is the last remaining Chuck Norris memorabilia on earth (apart from the earth itself). It was actually his first shit pot. When he grow up and left it, crowds of people started coming in just to view his shit and soon, kings, soldiers, gladiators and animals started fighting for it.","Chuck Norris doesn't just bend space-time, he can turn it into a goddamn balloon animal.","Chuck Norris has a special stare that turns goat crap into gasoline","Chuck Norris was featured in an episode of Deadliest Warrior, winning all 1000 simulated battles. His opponent was the USS Nimitz.","Only snails and garden slugs produce more lovemaking slime than Chuck Norris.","Chuck Norris once went over Mach 4 using a hang glider.","Martial arts learned Chuck Norris","When The Four Horseman of the Apocalypse entered this world, the first person they met was Chuck Norris. They now bunk at his horse ranch in Texas and clean the manure from the stables every morning.","Chuck Norris has already clocked Grand Theft Auto 6.","Chuck Norris once tried to teach a fat, stupid kid Martial Arts. Unsuccessfully. The kid grew up to be Steven Seagal.","Chuck Norris can kill Liberty Prime in one hit with a BB Gun.","If you offend Chuck Norris in any way, he will murder you without a second thought. Or even a first one.","Chuck Norris's Minecraft username is \"Herobrine27\". Should be just \"Herobrine\" in my opinion. He deserves it.","Chuck norris was batman and Bruce Wayne was Robin, but then chuck got bored so Bruce was promoted","If mike tyson and mahammud ali fought who would win. CHUCK NORRIS","The Rolling Stones would have disbanded less than six months after they formed if Chuck Norris hadn't attended one of their early gigs and jumped onstage to play a devastatingly awesome guitar solo, thus terrifying them into staying together for decades. (Oh, and he also pimp-slapped Mick Jagger in the lips, permanently disfigureing him.)","Chuck Norris is So Badass, he went to the island of Coradie to kick Ganon's Ass.","Chuck Norris has already won the Tour De France whilst sitting on a tortoise's back with no legs. In 2015.","Chuck Norris enjoys a love/convert relationship with lesbians.","Chuck Norris killed the Earl of Sandwich and ate the fillets between two loaves of bread.","Chuck Norris where's a black belt around the beard that he grows on his dick","Chuck Norris changed his name to jesus christ to avoid the pauperize","Chuck Norris is suing CNN for using two of his initials in there name...","Chuck Norris dosen't call 911.. 911 calls Chuck Norris..","Dont waste your time. Die from Chuck Norris! :D","Chuck Norris officially pimped Xzibit.","There's more than one way to skin a cat. Chuck Norris knows 437 ways to skin a cat and uses a different one every morning.","I put Chuck Norris into an online anagram generator and only got one anagram - \"Don't rearrange these letters or else Chuck Norris will rearrange your face.\"","When a problem comes along, Chuck Norris whips it. He whips it good.","The reason why TV shows get interrupted with emergency broadcasts is because Chuck Norris is interrupting the show.","The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.","Chuck Norris can eat only one lays chip, and walk away","After returning from World War 2 unscathed, Bob Dole was congratulated by Chuck Norris with a handshake. The rest is history.","A child once got a Chuck Norris action figure for his b-day and he made the mistake of calling it a doll... he hasn't come out of the coma yet","In the X-Men movies, none of the X-Men super-powers are done with special effects. Chuck Norris is the stuntman for every character.","Chuck Norris ejaculates hot mercury","Chuck Norris flosses his teeth with barbed wire.","Chuck Norris usually opts for the 2pt conversion, but asks that the ball be spotted on the 50 yard line.","Learning that Santa isn't real doesn't make children sad, it's the fact that Chuck Norris is","damn u Chuck Norris no one watches faggot sam except my mom and micheal jackson","they once made Chuck Norris toilit paper but there was a problem Chuck Norris doesnt take crap","Chuck Norris' tears cure cancer...shame he never cries","Chuck Norris doesn't defy gravity. He simply kicks it in the nuts.","Chuck Norris once listened to an entire song....on mute","Only a very few people are capable of water skiing on thier barefeet. Chuck Norris can water ski on his bare face.","Chuck Norris won the Thanksgiving Day Giant Pumpkin contest by weighing in only one of his testicles.","Like many other magnificient creatures, Chuck Norris has his own mating season, we know this season better as winter","Chuck Norris directed Two Girls One Cup","When Chuck Norris goes hiking in a rainforest, it is then known as a painforest.","Chuck Norris was dropped twice as a child, once on Hiroshima then again on Nagasaki.","When the Mormons knock on Chuck Norris' door, Chuck Norris sends them to heaven.","The rule about never looking directly at the sun applies to looking into Chuck Norris' eyes as well.","Chuck Norris shot tupac and biggie.","Chuck Norris has counted to infinity and negative infinity, mutliple times, while waiting in line at the DMV.","Chuck Norris recently did an audio commentary of one of his best-selling novels.","The active ingredient in Viagra, Cialis and Levitra comes from the seed of Chuck Norris.","Chuck Norris can knock that chip off your shoulder, dip it salsa and eat it.","Chuck Norris's poster once kicked my ass and put me in the Hospital for a year.","Chuck Norris made the mayans extinct.","Chuck Norris' density: 89,000,000 Kelvin (otherwise known as 1 Norris)","If you are next to Chuck Norris then you will always have perfect cell phone reception","Chuck Norris slaughters anyone named Chuck or Boris.","Bruises are caused by Chuck Norris tapping you with his finger.","Chuck Norris is the only one that knows the meaning of life!","Chuck Norris taught Dave Hester how and when to say yuuup!","Chuck Norris has a deep and abiding respect for human life... unless it gets in his way.","Chuck Norris has a moat around his ranch named Rubicon, and you best not cross it.","White noise is just the gathered screams of Chuck Norris' victims.","Chuck Norris roundhouse-kicked the acting ability out of Vin Diesel.","Muhammad Ali developed Parkinsons disease after he received a roundhouse from Chuck Norris","Chuck Norris can beat up Hugh Wackman.","When Chuck Norris needs to travel by plane, he makes BA Baracus fly him.","Chuck Norris can catch a train, i feel sorry for the person who has to throw it to him.","When Chuck Norris goes into a bar, he likes to have his whiskey mixed with a little 72 oz. steak, five bullet fired fresh from an AK 47, piss from an agitated rattle snake and a slice of lemon. He squirts the lemon juice directly in his eyes before drinking the entire thing of whiskey, yelling, \"CHUCK NORRIS HORNY!!\" and then killing everyone in the bar with his overgrown mammoth of a penis.","Rifle barrels are modeled after Chuck Norris' urethra.","Chuck Norris is so ruthless, he will punch out any old bitch named Ruth on sight.","Chuck Norris owns all of the No. 1 pencils.","Once Chuck Norris took a Vacation to the bahamas,he was watching oprah when she said somthing funny he pissed himself and laughed so hard is started hurracane katrina","jesus can walk on water. Chuck Norris can swim on land","Chuck Norris had a confirmed kill count of over 50 by his third birthday.","This little piggy went to the market,this little piggy stayed home,this little piggy went we we we all the way home because Chuck Norris delivered a fatal roundhouse kick to the other piggy.","Chuck Norris is what willis was talkin bout","Chuck Norris will not allow his image to be associated with losers! That's why he changed the title of his syndicated TV series from 'Walker, Texas Ranger' to 'Walker, St Louis Cardinal'.","Chuck Norris once swung a walrus around by its tusks and threw it half a mile. He kept the tusks.","Chuck Norris was on one part on Titanic.... He was the iceberg!","Chuck Norris loans money back to his creditors at 6.87% (apr) above his borrowing rate from them. They then loan that money to the U.S. Gov't at a hansome profit. Then the lending banks file bankrupcy and the U.S. Gov't borrows money from China to bailout the U.S banks and China borrows money from Chuck Norris to loan to the U.S. Gov't. This is the world economy 2012. Confusing ain't it?","Chuck Norris can taste lies.","Chuck Norris can literally hand you your ass in a handbag. And then pull it out and kick it up between your ears.","Chuck Norris roundhouse-kicked Mike Tyson, permanently damaging the \"social\" and \"speech\" parts of the brain. This is why Mike Tython talkth like thith and has an Antithocial Perthonality Dithorder.","Whoever said \"You can't win them all\" obviously never met Chuck Norris","Chuck Norris will beat you with his nunchucks. Chuck Norris will roundhouse kick you with his Chuck Taylors. Chuck Norris will feed you to the woodchucks. Don't fuck with Chuck!","Chuck Norris hungers only for vengeance.","Chuck Norris invented the nipple cripple.","The rope that they made to hang Saddam Hussien was made out of Chuck Norris' beard hair. It never released its grip.","Chuck Norris uses a submarine periscope as a bong.","Chuck Norris always sets off the metal detector at airports, even when flying naked.","Chuck Norris doesn't clip his nails with nail clippers, he clips his nails with scissors, and they work perfectly.","Anatomy and Physiology is now the study of how and why our bodies are ultimately inferior to Chuck Norris'.","Chuck Norris inhaled helium and had a much deeper voice.","Chuck Norris. The mere whisper of his terrifying name can make a hardened marine cry out in the night, impregnate a virgin and shatter all the glass within a five-mile radius.","The Military has nothing on Chuck Norris. Chuck Norris is the real ARMY OF ONE!!!","Chuck Norris' snot has the same properties as C-4 explosive.","Chuck Norris never has to \"Pee\"--his dick has to piss. (so big it has its own thought process)","Chuck Norris can hit a barn door with a broad's side.","In a new western movie his fellow actors ride horses. Chuck Norris rides a Velociraptor. Bareback.","When Mark Zuckerberg invented facebook he had a friend request from Chuck Norris.","Chuck Norris can call himself on his own cell phone and not get a busy signal.","Bob the Builder. Can he fix it? .... Not while Chuck Norris is alive.","Jesus walked on water. Chuck Norris swam on land","After the start of the race, Chuck Norris took a two day vacation in Italy, eviscerated a Yeti in Switzerland, then won the Tour de France by riding backwards on a tricycle while potty training a wolverine.","Chuck Norris knows all the words in the dictionary, except the word \"Mercy\".","Chuck Norris can hack the shit outta you with a samurai sword and make it look like you died of natural causes.","Osama Bin Laden is Chuck Norris's bitch","Chuck Norris died ten years ago; however, death doesn't have the guts to tell him.","Chuck Norris' ego wears a cape and a crown.","Chuck Norris is the reason Jenny's afraid to leave the Block.","Chuck Norris is not afraid of a skin walker","Chuck Norris once used a live rattlesnake as a condom.","Chuck Norris can make safety scissors dangerous.","Chuck Norris is a @$$ weeeeeeeeeeeeeee","Chuck Norris washes his hands in the Pacific ocean, and air dries them in tornadoes.","Chuck Norris slapped the black out of Michael Jackson","Chuck Norris gargles with thumbtacks.","Chuck Norris invented death just so he could kill people","Chuck Norris didnt audition for walker texas ranger he made da producers audition to film his life","Chuck Norris's car is fitted with go faster brakes.","It's said that, when this website gets to Fact #9001, Chuck Norris will kick it in the URL, rocketing it up to 10,000 facts.","Chuck Norris is Hugh Hefner's landlord. And he conducts random inspections.","Little Johnny's teacher asked him to describe Chuck Norris. Little Johnny said Chuck Norris is like a wheelbarrow full of awesome.","Chuck Norris bungee jumps with an anchor chain.","Chuck Norris is so gay i was like NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM NOM on HIS FACE!","Chuck Norris was once in a car accident and broke both of his legs... He still managed to walk it off.","Chuck Norris can tell time on a compass.","When Chuck Norris was in high school he played baseball. He did not use a bat, he just used his fist to punch the ball out of the park.","While waiting at the drive up window at the local KFC for his order of lobster thermidor, Chuck Norris chugged a gallon of Wild Turkey. When his order arrived, he barfed in the cashiers face and drove off laughing.","Chuck Norris is the one who shot the deputy.","Chuck Norris is so tough, he masturbates with sand paper.","Chuck Norris once rode a bull for 6 hours. He then ate it raw.","Chuck Norris drives Optimus Prime to work.","Chuck Norris gave 5 of his old watches to some teenages. Those teenagers are now known as the Power-Rangers","The ice Age was created when Chuck Norris accidentally left his freezer door open.","Tom Clancy has to pay royalties to Chuck Norris because \"The Sum of All Fears\" is the name of Chuck Norris' autobiography.","Chuck Norris' former 3rd grade librarian once \"shushed\" him for talking too loudly. Former librarian, Stephen Hawking, later became a world renowned physicist.","Every woman who has experienced multiple orgasms has one thing in common with all the others: each one was with Chuck Norris at the time.","The most obvious upside to receiving a brutal Chuck Norris roundhouse kick is is that you will enter the afterlife knowing that you have died the most awesome death possible.","Chuck Norris was bitten by a Zombie. Shortly thereafter, the Zombie displayed greatly increased muscle mass and some serious bad-ass tendencies.","Chuck Norris uses crab legs for toilet paper.","Chuck Norris takes Viagra to LOSE an erection.","5 star New York restaurants use Chuck Norris' toe jam as both a saffron and truffle substitute.","The next time you witness Chuck Norris brutally punching some asshole repeatedly in the face, if you look closely you will see little translucent '+50' numbers floating away.","CHUCK NORRIS ONLY COUNTS BACKWARDS WHY ? BECAUSE HE CAN","Chuck Norris actually ghost wrote all of Ernest Hemingway's novels and taught him the virtues of Key West fishing, rum drinking at Sloppy Joe's & whores.","Chuck Norris banned the sale of masks in his likeness, not because of the thousands of heart attacks they cause daily, but because he didn't want random assholes scoring all the pussy clearly meant for him.","Ever known anyone who pissed off Chuck Norris and lived to tell about it?  That is of course a trick question, as no one pisses off Chuck Norris and lives.","Chuck Norris isn't lusty- he only has bloodlust.","Chuck Norris wears a boxing glove instead of a condom.","Hammertime does not stop Chuck Norris","Richard Simmons is an example of someone acknowledging the existence of Chuck Norris. Before they met, Richard was originally known as Fabio.","Chuck Norris has slept with Carmen Sandiego. She has now fallen for him and stalks him.","Chuck Norris knew Palpatine was a Sith Lord all along.","The Chuck Norris facts game is played out... And we should all stop contributing to this stupid shit! Unless your a dickless gamer that dwells on this Chuck Norris nonsense","The sun is afraid to look chuck Norris directly in the eyes","Chuck NOrris is an incredible sitar player.","Chuck Norris got the most kills in a battle ground without no pvp gear or weapon","Chuck Norris doesnt believe in religion, religion believes in Chuck Norris","When Chuck Norris says he is \"Sorry\", its not for what he has done, but for what he is about to do.","Chuck Norris knows how many licks it takes to get to the center of a tootsie roll pop.","Every SQL statement that Chuck Norris codes has an implicit \"COMMIT\" in its end.","the last words heard by many kids in Chuck Norris' 1st grade P.E. class was \"tag your IT\"","When Chuck Norris was younger, he wore cowboy boots, had a red beard and could deliver a fatal roundhouse kick. Knowing this one could imply that Chuck Norris has always been awesome.","Phobias are afraid of Chuck Norris.","The universe is always expanding at a faster and faster rate, that's because it's running away Chuck Norris.","Chuck Norris taught man how to make the wheel.","Jiggy gets Chuck Norris widdit.","Chuck Norris name is in the webster's dictionary under roundhouse kick and above god.","Martin Luther King may have had a dream, but Chuck Norris had a body count.","Chuck Norris has more subscribers than Pewdiepie.","Panhandlers give Chuck Norris money.","When Chuck Norris plays Five Nights at Freddy's, the animatronics don't scare him. The animatronics come to him","Chuck Norris gargles with sulfuric acid.","Jehovah is the Hebrew word for Chuck Norris","Chuck Norris' blood type is diesel","Chuck Norris doesn't need sunblock. The Sun needs Chuck Norris block, CNPF (Chuck Norris Protection Factor) 1000000000000000","The reason why Chuck Norris is such a badass is he thought all the yo momma jokes were written about his mother.","When Chuck Norris sleeps, time stops.","the idea for the movie SAW was based off of the accounts of people who went into Chuck Norris' room when he was a kid.","-Chuck Norris is the reason NWA ran Straight Outta Compton. -Chuck Norris found what Bono was looking for. -Chuck Norris taught Pai Mei the Five Finger Death Punch. -Chuck Norris came before the chicken or the egg. -Chuck Norris once had sex on a plane. Nine months later, the Boeing had a litter of apache helicopters. -nuclear weapons are still hiding; even the H-bomb is afraid of Chuck Norris.","Chuck Norris CAN see John Cena, and he still had honks he's a bitch.","Chuck Norris can swim undisturbed, through shark infested waters with 2 pockets full of chum.","Chuck Norris recently broke Harrison Ford's ankle while he was busy banging Carrie Fisher on the Star Wars set.","school didnt teach Chuck Norris he taught school","Every attractive woman on Earth either gave her virginity, or will give her virginity, to Chuck Norris.","Chuck Norris can punch you in the face via messenger pidgeon","Chuck Norris doesn't ride in elevators. The elevator rides around Chuck Norris.","Chuck Norris won the New York Marathon while steaming some crab legs in Austin, TX","...and then Chuck Norris kills you in your sleep.","Chuck Norris gets more ass than a toilet seat.","Chuck Norris gave out the location of Osama Bin Laden!","The A-Team originally was to have only 1 member: Chuck Norris. But when NBC couldn't meet Chuck's salary demands, they had to replace him with the quartet of B.A., Face, Hannibal and Murdock.","Chuck Norris has seen it all, and done it all, so many times that he has long ago lost count.","Thanksgiving Chuck Norris Fact/Joke Time!   Most people have turkey for Thanksgiving. Chuck Norris has chicken for Thanksgiving.  \"Chicken\" meaning \"cowards\".","Chuck Norris round-house kicked micheal jackson and he turned from black to white","By the time I finished writing this joke, Chuck Norris had advanced from being a 6132-degree black belt to a 7834-degree black belt. By the way, this joke took me 1 minute to write.","Chuck Norris can fuck you upside-down.","Chuck Norris can eat Green Eggs and Ham anywhere he wants to.","Chuck Norris invented winning.","Chuck Norris doesn't see dead people. He makes people dead.","Chuck Norris drinks a gallon of oil every day to lubricate his nerves of steel.","When Chuck Norris hunts any type of game bird, he doesnt need a shotgun. He prefers to throw handfuls of gravel instead.","Files don't become declassified, Chuck Norris just decides when the people need to know.","Chuck Norris roundhouse kicked PSY in the face Gangman Style.","the hulk doesn't like Chuck Norris when he's angry.","A life-sized sculpture of Chuck Norris' genitals was sold for a world record price at a recent auction","Chuck Norris was expelled from kindergarten. His teacher told Chuck he could not be milk monitor so Chuck climbed up on a chair and knocked him out.","The Chuck Norris commandments: Thou shalt have no other master than Chuck Norris. (Chuck 1:1)","Chuck Norris has put together a string of conquests that would make even the most hardened cocksman flaccid with envy.","Chuck Norris eats Spicy Chicken Crunchwraps, made with live chickens.","The flu gets a Chuck Norris shot.","Every morning, Chuck Norris gets up and splashes boiling oil in his face to wake him up.","Steve Jobs gave a free iPad to Chuck Norris as a token of goodwill. Chuck Norris instantly rammed the device up Jobs' anus for insulting his unquestionable masculinity.","The bathroom comes to Chuck Norris.","Chuck Norris is a certifiable badass. That's right, he's got a certificate.","Chuck Norris catches up on his paperwork while skydiving.","Chuck Norris doesn't use Oracle, he is the Oracle.","Chuck Norris don't do facebook. No one can ever poke him.","In an act of great philanthropy, Chuck made a generous donation to the American Cancer Society. He donated 6,000 dead bodies for scientific research.","Chuck Norris can flush his toilet by simply scowling at it.","Chuck norris doesnt follow the yellow brick road....he made it by turning concrete yellow.","Q. What did Chuck Norris do with his first 50 cent piece? A. After climaxing, he punched her in the face and took back his half dollar. Nobody charges Chuck Norris for his services!","Chuck Norris once microwaved a bowl of instant oatmeal for Chef Gordon Ramsay who understandably loved it so much that he asked Chuck for the recipe.","Chuck Norris ordered a Whopper at Mcdonald's, and got one!!!!!!","Chuck Norris silenced noise.","Chuck Norris wishes you a knuckle sandwich, and a happy throat-punch.","meteors, there is no such thing those are the victims that being roundhouse kicked by Chuck Norris","Chuck Norris delights in having BLT sandwiches for lunch! But understandably his BLT's are made of Barracuda, Leaches & Tarantulas nn buttered Texas Toast.","Katy Perry kissed a girl to get attention from Chuck Norris.","Chuck Norris' wristwatch is accurate to one second every ice age.","March 10, 2010. Today is Chuck Norris's 70th birthday. As he blew out the candles on his birthday cake, coincidently there were 70 forest fires in California and surrounding states.","The Iraq war is over because the US sent Chuck Norris to Iraq","Chuck Norris once won a game of duck, duck goose using only the word \"goat\"","Chuck Norris has been to Jupiter; that's why there's the big red spot.","Chuck Norris drinks a gallon of oil every day to lubricate his nerves of steel.","when Chuck Norris went to burger king he asked for a big mac, one minute later they gave him one","Chuck Norris decided to try bull riding. He drew a nasty bull named Snort. When Snort heard Chuck was going to ride him, he went to his veterinarian, got castrated and changed his name to Daisy.","Chuck Norris' pet mouse, Mr Whiskers, ate a cat.","Chuck Norris can split/fuse atoms through his piercing stare.","Chuck Norris doesn't clip his nails with nail clippers, he clips his nails with scissors, and they work perfectly.","Before Chuck Norris dunks his doughnut in piping hot coffee, the doughnut hole reconstitutes itself and begs for mercy.","Chuck Norris uses the big dipper to eat his cereal.","The big bang theory: Chuck Norris winning a arm wrestle with godd","Chuck Norris can sing in a bass voice that makes Barry White and Lou Rawls sound like members of The Chipmunks by comparison.","Brokeback Mountain is not just a film. It's also what Chuck Norris calls the pile of dead ninjas is his backyard.","Chuck Norris once played truth or dare there where no survivors. no one dares Chuck Norris and no one asks Chuck Norris to tell the truth.","How much wood could a woodchuck chuck if a woodchuck could Chuck Norris? Fucking ALL of it.","You must always pay attention while driving, in case you are distracted for a split second and Chuck Norris drop-kicks a midget through your windscreen","Chuck Norris made the mayans extinct.","The last words Johnny Cash ever heard - \"I'm Chuck Norris\".","Chuck Norris can punch the 'you' out of you.","Chuck Norris was supposed to star in the TV show 'Man vs Wild', but the network did not want kids thinking 'lava is safe to eat'.","Those big men escorting Chuck Norris during public appearances aren't body guards, they're in the Federal Witness Protection Program.","Chuck Norris cooked what Meg Ryan was having.","Chuck Norris puts mustard gas on his hotdogs.","chuck Norris just roundhouse kicked billy ray cyrus for mileys twerking","Chuck Norris can beat you up with a grain of sand","Alls well that ends well. But if your life ends with a Chuck Norris roundhouse kick, all is not well.","After seeing ''The Blair Witch Project'', Chuck Norris went into the woods, found the Blair Witch, and roundhouse-kicked it repeatedly until it died. When Chuck Norris pays 6 dollars to see a witch movie, you'd better show him a fuckin' witch.","The First rule of Chuck Norris is: you do not talk about Chuck Norris.","A man once taunted Chuck Norris with a bag of Lay's potato chips, saying \"Betcha can't eat just one!\" Chuck Norris proceeded to eat the chips, the bag, and the man in one deft move.","Chuck Norris IS the father of every single one of Maury Povich's guest's children. The \"possible fathers\" are also Chuck's children.","Chuck Norris can kneecap you just by simply poking you in the eyes.","Chuck Norris struck gold while performing his own prostate exam.","The pie scene in \"American Pie\" is based on a dare Chuck Norris took when he was younger. However, in Chuck Norris' case, the \"pie\" was the molten crater of an active volcano.","Time waits for no man. Unless that man is Chuck Norris.","Chuck Norris can touch a bottomless pit","Once, as a child, Chuck Norris lied to his parents. Seconds later, their pants caught on fire.","Chuck Norris can bench press an Army tank. While sitting inside of it.","Chuck Norris once roundhouse kicked a cotton field in Mississippi instantly creating the first Levis factory as well as adorning his torso with a sleeveless denim vest","The Terminator said \"I'll be back\" He meant to say \" I'll be back with Chuck Norris\"","If Chuck Norris tried to punch himself he would deflect each blow creating an infinite loop. A paradox nobody can solve, except Chuck Norris.","Old Faithful is Chuck Norris' drainpipe","Chuck Norris's Piss can be used as a preworkout!","Fool me once: shame on you. Fool Chuck Norris once: actually, you can't ever fool Chuck, and he'll kill you for even thinking about it.","After the start of the race, Chuck Norris took a two day vacation in Italy, eviscerated a Yeti in Switzerland, then won the Tour de France by riding backwards on a tricycle while potty training a wolverine.","Movies and TV shows fail when they do not impress Chuck Norris.","Chuck Norris can win a staring contest with a statue.","Chuck Norris' house has a ceiling, but no roof","Chuck Norris recently conducted a performance with the London symphony orchestra with his penis while juggling three running chainsaws.","Chuck Norris wears a size 2 ballet slipper.","lmao to the ones underneath,, Once Gary Neville and Chuck Norris had a arm wrestle no one knows who won as everyone there had an fatal fit on the thought on Gary Neville and Chuck Norris in the same room!","Chuck Norris once turned Medusa to stone","Rhythm is a slave to the Chuck Norris","When Chuck Norris goes for broke, he always ends up with millions more.","Chuck Norris always has sex on top because Chuck Norris never screws up!","Chuck Norris once finished a round of golf at 72 under par.","A guy challenged Chuck Norris to a knife fight so Chuck used what he had on hand and stabbed the guy to death with a toothpick.","There are soccer moms, and then there are Chuck Norris moms. And guess which one yours is.","Some people can ride a bike no-handed; Chuck Norris can ride a scooter NO-LEGGED","Joe Namath felt safe making his Super Bowl III guarantee because Chuck Norris said the Jets would win.","There is in fact an 'I' in Norris, but there is no 'team'. Not even close.","Over the hills and far away...... CHUCK NORRIS COMES TO PLAY!!!!!!!!","If a vampire bites Chuck Norris, it becomes his slave.","Chuck Norris can choke you with a cordless phone.","The only things you can be sure of are Chuck Norris and taxes.","Chuck Norris once knocked himself out with his own line drive when he slid into second.","Chuck Norris takes everything for granite.","Once Chuck Norris died just to see how it feels like to be dead. The next day he resurrected himself and roundhouse kicked everyone who celebrated his temporary death.","Chuck Norris was the only professional boxer ever who was allowed to perform fatality moves on his defeated opponents.","Chuck Norris gives cigarettes cancer","Chuck Norris can speak in sign language.","Chuck Norris has a beard made of Brillo Pads","Once in olden times, Chuck Norris roundhouse kicked the ancient King of Canniptia in the face. Then, the remaining old world Canniptions threw a fit. Thank goodness the neighboring ruler of Hissyopia was not also kicked in the face or there would have also been a Hisssy fit to deal with!","All individuals that have remarkably survived a Chuck Norris attack suffer what in medical terms is called 'optical rectumitis'. That being having their assholes kicked out through their eyesockets","Throughout his life, Chuck Norris has been widely acknowledged and praised for the extreme realness with which he kept his shit.","The Battle of the Little Big Horn was lost soley because an inebriated Custer errantly set Chuck Norris' GPS to a location some 85 miles away called the Big Little Porn.","Chuck Norris sneezed in Japan- therefore causing Hiroshima to be bombed.","What is black, white and red all over? Chuck Norris roundhose kicked an actor in a black and white old movie.","Chuck Norris is a PhD in Pain. However, his advances in the field of Pleasure have earned him a Nobel Prize.","When Chuck Norris watches Bubble Guppies, he gets pissed off and jumps into the TV and roundhouse kicks the motherf$&!ing sh*t out of them.","JACKSON ... PHAHAH FUCKIN HARDEST GUY IN ROCHDALE HERE REPPIN 2K9 BIG TIME,,  PLUS MY SISTER IS FITTTTT !! OFFT SOME NICE PUSSY ON THAT BITCH xx  CHUCK NORRIS X","CHuck norris can fly a kite indoors","Chuck Norris once wrestled a huge alligator for over 9 hours before he realized that he was actually masterbating.","Chuck Norris had a brief stint as a lumberjack until he almost cut his penis down by mistake","Neil Armstrong finally wore out Chuck Norris' patience.","Chuck Norris is my nigga","Chuck Norris favorite artist is Celine Dion. No homo.","Chuck Norris ... yeah that's right.","When Chuck Norris was 8 years old, he raped a pedophile","To Chuck Norris, rules and necks exist for the same reason; to be broken.","Chuck Norris and Rick Perry were driving through Texas on a beer dinking binge. And Rick Perry threw a lit cigarette butt out the window.","Those who say you can't unring a bell never met Chuck Norris.","When Chuck Norris inhales a helium balloon his voice will sound like Barry White in slo-mo for the next nine hours.","The reason the slinky was invented is because there is no condom long enough for Chuck norris's dick. It failed miserablly now he has to were a live ratlle snake as one.","The sun really shines on Chuck Norris. We just happen to live close enough to him.","In soviet Russia Chuck Norris still kicks your ass!","It is possible to look to the left and right at the same time with just a roundhouse kick from Chuck Norris","Chuck Norris once participated in the running of the bulls, the bulls were running because chuck Norris was behind them","After taking a steroids test doctors informed Chuck Norris that he had tested positive. He laughed upon receiving this information, and said \"of course my urine tested positive, what do you think they make steroids from?\"","I give up. farewell Chuck Norris. *shoots himself*","One day Chuck Norris was bored, so he grabbed a lighter, put it up to his ass, and farted. This was known as the Big Bang.","Chuck Norris does die, but is reborn an adult seconds after he dies.","Chuck Norris can squeeze orange juice out of a banana.","Superman has x-ray vision but can't see through lead walls. Chuck Norris can't see through lead walls either, but he can see over & around lead walls because he has periscope vision.","When a waiter asks Chuck Norris what he wants to drink, he responds with a roundhouse kick to the face and collecting the waiter's tears in a glass. He drinks them and then tells the waiter for ice next time.","Chuck Norris is gay. By saying that sentence, my life expectancy is down to three secon","If you look up Chuck Norris in the dictionary, you will get Round house Kicked in the face, or the balls, depending on how you are holding the dictionary.","Chuck Norris once kicked a baby beluga whale into puberty.","Chuck Norris is the undisputed lord and master of trampoline sex.","Chuck Norris thinks anyone who says that violence never solved anything is probably a pussy and causing problems","Chuck Norris once acquired two Harley-Davidsons by Karate-chopping a muscle car in half.","When Chuck Norris wa born 3 nurses and 2 doctors were killed when he shot them with 2 MPK-5's he had developed while in the womb.","Chuck Norris doesn't believe in Germany.","When the mother of Chuck Norris was pregnant she could feel him moving in her stomache. Little did she know, he was perfecting his Round House Kick.","The Fifty Shades of Grey trilogy is loosely based on Chuck Norris' prepubescent days.","why is flag waving on the moon? Chuck Norris was running around","Chuck Norris can sleep with eyes OPEN.","Calculator's refuse to work around Chuck Norris in fear of outsmarting him","Chuck Norris is gay. By saying that sentence, my life expectancy is down to three secon","Bono cant find what he is looking for because Chuck Norris found it first","Chuck Norris is a bulldozer with a beard.","Your odds of surviving a Chuck Norris attack are slightly less than: -1/100.","Chuck Norris takes knives to gun fights.  Chuck Norris opens presents on your birthday.","Chuck Norris doesn't actually write books, the words assemble themselves out of fear.","Aliens acid isnt nearly as bad as Chuck Norris's spit.","Superman has x-ray vision but can't see through lead walls. Chuck Norris can't see through lead walls either, but he can see over & around lead walls because he has periscope vision.","Chuck Norris CAN eat only one Lays Potato Chip.","It is said that, on average, men think about sex every seven seconds. That average is based solely on Chuck Norris.","When most people think of \"bone china,\" they think of flatware.  Chuck Norris is reminded of the three weeks he spent sampling the best whorehouses in Hong Kong back in '78.","Chuck norris once killed a postman.He then waved his finger side to side and said \"hey buddy only i deliver round houses, got it!\"","Chuck Norris knows who the fuck Alice is. She is now living next door to him.","Chuck Norris made Stephen Hawking run for his life.","Chuck Norris' urine is used to disinfect hospital emergency rooms.","Chuck Norris sleeps with a pillow under his gun.","Chuck Norris once impregnated a Jumbo Jet and fathered a squadron of F-15 fighter jets.","CHUCK NORRIS IS THE REASON HITLER KILLED HIMSELF. HE KNEW HE COULD NOT TAKE OVER THE WORLD WITH HIM STILL IN IT. NOBODY CAN TELL CHUCK WAT TO DO.","Chuck Norris doesn't clip his fingernails... he rips them out with his bare hands and regrows new ones immediately.","Chuck Norris can take selfies of other people","in stead of a chin under hes beard, Chuck Norris only has another fist","Chuck Norris' neighbor asked if he could help fix his taps. Chuck fixed his taps, all right - then tapped his wife.","The only reason Chuck Norris didn't win an Oscar for his performance in \"Sidekicks\" is because nobody in their right mind would willingly give Chuck Norris a blunt metal object. That's just suicide","Chuck Norris ran out of fucks to give ages ago. And he didn't have all that many to begin with.","Chuck Norris will find you jacen heilman","Chuck Norris greets everyone by hoisting them over his head.","Chuck Norris can end the recession with one phone call.","Chuck Norris changes saw blades while using the saw!","Industrial logging isn't the cause of deforestation. Chuck Norris needs toothpicks.","Chuck Norris' penis has a dorsal fin.","Chuck Norris can cut Granite, with a butter knife.","The sun moves across the sky because its running from Chuck Norris.","Chuck Norris can literally slap you stupid.","Chuck Norris doesn't always get into fights but when he does you see some serious shit.","Chuck Norris' microwave has killed many a creature.","Chuck Norris makes a world famous tray of chocolate chip/macadamamia flavored Snickerdoodle cookies from his dingle berries and toe jam.","Chuck Norris once allowed a man shoot an apple off his head at 20 paces with a 12 gauge shotgun. He was unharmed of course.","When Chuck Norris says he is \"Sorry\", its not for what he has done, but for what he is about to do.","Chuck Norris once kicked a horse in the chin. Its decendants are known today as Giraffes.","Chuck Norris does not hang ductwork. Ductwork hang's itself when it encounters Chuck Norris.","Chuck Norris don't give a fuck. Fuck gives Chuck.","AHEM... Chuck Norris Fact/Joke.","Chuck Norris once defeated the Statue of Liberty in a Stop Dance Contest.... at kindergarten!","One time while hunting deer, Chuck Norris made a kill shot from 300 yards. No big deal u say? his weapon of choice was a squirt gun.","Chuck Norris can implode an explosion making it explode some more.","Chuck norris had his cake, and ate it too, then ate everyone elses","Chuck Norris can't actually walk on water but he never got over knee deep while walking across the Atlantic ocean.","CHUCK NORRIS NEESDS TO USE A SEATBELT WHEN USING THE TOILET BECAUSE OF RECOIL!","southpark is Chuck Norris heavens","Chuck Norris can make pigs fly.","When Chuck Norris was asked about his role in The Forest Warrior during an interview, he responded to the reporter with a left hook. Then he took out a guitar from his beard and played the epic solo to the extended version of the Walker: Texas Ranger theme.","The leaning tower of Pisa used to stand up straight. That is..... until Chuck Norris roundhouse kicked it.","Chuck Norris turned down a role in Brokeback Mountain (as Tex, ass-ranger) because of foul language and not enough sex scenes.","Since the age of eight, Chuck Norris' penis has been permanently set to 'seek and destroy'","Chuck Norris' jock strap has 2 bag restraint holders.","Schindlers List is based on one of Chuck Norris wet dreams","Chuck Norris made the dinasaurs extinct","Chuck Norris follows everyone on Twitter... and in real life... at the same time.","Jesus wears a bracelet that says wwcnd (what would Chuck Norris do?)","Movie trivia: The movie \"Invasion U.S.A.\" is, in fact, a documentary.","When Chuck Norris was a baby, both of his mother's tits had a milk moustache and beard.","Chuck Norris can make a virgin go ass-to-mouth on a first date.","Chuck Norris laughs Death in the face","Many a cowboy has ridden a brahma bull barebacked. Chuck Norris has ridden many a grizzly bear bullbacked.","Time stops whenever Chuck Norris takes his shades out of his pocket and slowly puts them on.","Theres a computer virus named rndhsekck. If you open the virus, it roundhouse kicks you in the face..from Chuck Norris.","If Chuck Norris ever ruined your life, you'd probably want to kill him. But you couldn't.","Chuck Norris invented teabagging when he was having sex with Queen Elizabeth","Chuck Norris walked into LAX airport wearing a full suit of armour and carrying two Gatling guns and walked directly from the check-in desk to the cockpit of his plane uninterrupted.","Chuck Norris doesn't dial the wrong number. You answered the wrong phone.","The Pope calls Chuck Norris \"Father.\"","Chuck Norris flosses with steel cable.","Chuck Norris doesn't jump because if he jumps he makes a hole in the ozone layer.","Chuck Norris can upload photo's of himself on you tube.","The flu takes a Chuck Norris shot every year","When Chuck Norris does division, there are no remainders.","Chuck Norris kicked-in The Amazing Kreskin's face. Thus proving a Chuck Norris attack to be an unpredictable life event.","Chuck Norris got mad at some vegetables, the end results were Black-eyed peas.","The orgy scenes in \"Caligula\" pale by comparison to the 21st Birthday party thrown for Chuck Norris.","Chuck Norris underwent successful hemorrhoid surgery yesterday. The surgeon had to use \"the jaws of life\" and a set of bolt cutters to complete the procedure","Chuck Norris walked into a catholic church. He was asked by parents to piss in the holy water so their children could be baptized.","Many don't know Chuck Norris was arrested when he was 10. Chuck beat up a 26 year old guy in a bar fight.","Chuck Norris uses the woods as the bathrooom.","Chuck Norris does not buy snake proof boots,he puts on boots than they are snake proof","Chuck Norris is the only co-star he can work with.","Chuck Norris made Dave Grohl his monkey wrench.","If more boys had Chuck Norris as male role model while growing up there wouldn't be as many queers in the world.","When Chuck Norris plays taekwondo, he beats the referee.","In thinking of famous celebrities, Chuck Norris & Dolly Parton come to mind. Now that's a couple of big ones for ya!","Chuck Norris's Total Gym Contract: $10 million 5% of total sales 30 days of banging Christie Brinkley  Christie Brinkley's Total Gym Contract: 30 days of getting banged by Chuck Norris","Chuck Norris doesn't have a shadow anymore because he roundkicks a wall if it appears","Ladies put the toilet seat back up for Chuck Norris.","Chuck Norris forced Bill Cosby to rape Bruce Jenner.","Chuck Norris is the reason that the Army had to change their slogan, \"Army of One\".","You may be wondering, 'why can't Chuck Norris use his incredible powers to end poverty, starvation and disease and bring about world peace?' Shut the fuck up, that's why.","There is only one thing Chuck Norris can't do... He can't die. But even if he prove me wrong, he'll still be alive afterwards.","Chuck Norris can speak hundreds of languages, but the four he mainly uses are English, Profanity, Sarcasm and Real Shit.","Chuck Norris does not walk. The Earth rotates for him out of sheer terror.","The 3D Chuck Norris movie was rated RRRR because no one made it out of the theater. No one ever crosses Chuck Norris!","Chuck Norris is evil kenivels stunt double","If you fight Chuck Norris, you can not retreat or surrender. He will kill you long before you can do either.","Chuck Norris once made an egg lay a chicken.","Chuck Norris:  Chilling Hulking Undeniable Cunning Killing  Not nice Order Ripped Righteous Invincible Sensational","All of Chuck Norris' chinese ex-girlfriends say \"chuck can fuck\" but it didnt work out because \"chuck ig-nore-us\"","When Chuck Norris brews a strong pot of coffee he uses a flame thrower and 1/2 of Columbia's coffee trees.","Chuck Norris will find you jacen heilman","Chuck Norris is gay!","Chuck Norris went for a stroll in the jungle and was ambushed by a very hungry tiger. The attack was brutal, merciless and clinical. The tiger just doesn't have a ghost of chance at all. That is how Chuck Norris got the tiger rug in his living room.","Children check under there bed for the boogie man. The boogie man checks under his bed for CHUCK NORRIS. CHUCK NORRIS checks under his bed for ME!!","There are many people in this old world that have had an eyeball knocked out of one of their eye sockets because they say that they didn't see a Chuck Norris roundhouse coming. They all say that they have learned a valuable lesson & from now on they'll always keep an eye out for Chuck Norris.","Chuck Norris once consumed a 40lb sack of rice in under 8 minutes... using a single chopstick.","Chuck Norris's belly button does'nt collect lint, it collects steel wool.","The real reason the Titanic sank was because Chuck Norris want to get off and go for a swim.","Chuck Norris is the Grand Master Leader of Anonymous, the Illuminati, the Freemasons, Ordo Templi Orientis, Skull and Bones and the Loyal Order of the Face Smashers.","Chuck Norris can play halo on ps3  Chuck Norris can play infamous on xbox 360","Chuck Norris' wristwatch is accurate to one second every ice age.","James Bond says his name twice to introduce himself. Chuck Norris just roundhouse kicks you in the face.","According to Chuck Norris the translation of \"hors d'oeuvres\" to english is \"whores ovaries\".","Chuck Norris can unscramble an egg","Chuck Norris is not Irish. His hair is soaked in the blood of his victims.","Chuck Norris famously once said: \"With great power comes great responsibility. But sometimes, y'know, fuck it.\"","the movie \"contagion\" is a movie about what would happen if Chuck Norris ever to sneezed.","Chuck Norris walked into a bank during a robbery. When the crooks saw Chuck, they returned all the money then gave the teller all the money from their own wallets.","Chuck Norris is the lord of chuckalingus.","Chuck Norris is a supporter of gender equality in the workplace. That's why he makes his female employees work longer hours so they can earn the same as the men.","Chuck Norris injects hot coffee directly into his eyeballs.","god created jesus-Chuck Norris created god","When Chuck Norris breathes there are hurricane warnings","Contrary to popular belief, the groundhog does not fear seeing its shadow. It actually fears seeing Chuck Norris.","Chuck Norris was once in a knife fight, and the knife lost.","Chuck Norris honestly does read Playboy for the articles, as all the models are too plain and flat-chested.","Chuck Norris. The mere whisper of his terrifying name can make a hardened marine cry out in the night, impregnate a virgin and shatter all the glass within a five-mile radius.","I think, therefor, Chuck Norris let me exist","Chuck Norris was born during a firefight. The police captain threw him a Glock.","As a child, Chuck Norris used to engoy making shapes in sandboxes. we call them pyramids","Chuck Norris can play rock-paper-scissors in a mirror - and win.","A clarvoyant once offered to read Chuck Norris' palm. After staring at it for about thirty seconds, her head exploded.","They don't have a Chuck Norris wax statue at Madame Tussauds till now cos everytime they make one, it comes alive and destroys all other statues.","Chuck Norris invented the soccer ball by dehydrating a zebra.","Newton discovered gravity beacause Chuck Norris threw an apple at him","CHuck Norris rests his morning cup of coffee on his morning wood.","Some people can make animal shapes out of balloons.  Chuck Norris can do the same with human organs.","When Chuck Norris got cut off in traffic, he rammed the offending car off the road, pulled the asshole out by his hair and slapped him to death with his schlong. Then he boned his wife on the hood of the car, in full view of passing motorists. Don't fuck with big Chuck.","In the medical community, death is referred to as \"Chuck Norris Disease\"","Chuck Norris shaves by simply scraping his fingernails across his cheeks.","Chuck Norris' pet snail can go 50 mph and that's only it's jogging speed.","Chuck Norris can impregnate a woman over the phone","The only time Chuck Norris felt sadness was when he read Nuck Chorris' jokes.","The big bang theory: Chuck Norris winning a arm wrestle with godd","Chuck Norris overheard an old man complain that his Metamucil just wasn't providing enough fiber to take care of business. So, a kind Chuck Norris rammed an oak tree up the old man's ass, lit it up with a flame thrower and yelled: \"fire in the hole\".","Every night when Chuck Norris goes to sleep, his beard detaches itself, picks up a small knife and sprints towards the city in hopes to match his kill count.","Sometimes people die though they deserve to live. None of those people were killed by Chuck Norris. When Chuck Norris kills someone, they damn well deserve it.","cats don't mess with Chuck Norris, coz they know dat 1 kick from him equals to 5 cat lifes and we all know Chuck Norris doesn't kick once","Michael Jackson didn't have a rare skin disease.... Chuck Norris beat the black outa him.. ..at Michael's request. The injuries were so severe it required several years of intense surgery.","Chuck Norris is the only person on earth that can look dignified riding a Segway.","Chucky has a deep love for Chuck Norris' penis.","Chuck Norris is the 8th wonder of the world","Chuck Norris challenged a staring contest with Weegee then Weegee turned into Chuck Norris","Chuck Norris is gay!","CHUCK NORRIS DOESNT TEA BAG LADIES....HE POTATOE SACK THEM","It was going to be called 'Expendables 2: The One With Chuck Norris', but he decided to give all the other movies a break.","Chuck Norris can save 15% or more on car insurance WITHOUT switching to Geico... or even buying car insurance.","When Chuck Norris speaks French, he doesn't sound gay.","Chuck Norris can fly upside down in a jet pack.","Chuck Norris' last kid was born 10 months after his 23rd vasectomy.","When Mark Zuckerberg invented facebook he had a friend request from Chuck Norris.","Chuck Norris dosn't climb mountains; mountains climb Chuck Norris.","Chuck Norris beat the director of 'Good Luck Chuck' to death with a pool cue.","Chuck Norris washes his hands in the Pacific ocean, and air dries them in tornadoes.","You know the move where Scorpio removes the spine in mortal combat? Well Chuck Norris can do that to invertibrates!","At this moment there is a fifty-fifty chance Chuck Norris is fucking your sister","The Rolling Stones would have disbanded less than six months after they formed if Chuck Norris hadn't attended one of their early gigs and jumped onstage to play a devastatingly awesome guitar solo, thus terrifying them into staying together for decades. (Oh, and he also pimp-slapped Mick Jagger in the lips, permanently disfigureing him.)","Chuck Norris built the hostpital he was born in.","Chuck Norris once watched a girl give him a blow job. she died the next second...","Chuck Norris can us an abucus to solve differential calculus equations.","A mere slap in your face from Chuck Norris causes permanent, life long strabismus.","Chuck Norris eats cold beans out of the can and thinks he's the next fucking Gordon Ramsey.","Chuck Norris knows how the Neverending Story ends.","Spongebob is Chuck Norris' old lufa.","Chuck Norris doesn't drink often. But when he does, he prefers to kick 'the most interesting man in the word' in the ass & take his Dos Equis.","Chuck Norris' bedroom has leather walls.","A panel of 5 judges survived after allowing a young Chuck Norris to win his 5th grade spelling bee by correctly spelling the word \"Encyclopedia\" as b,o,o,k.","Chuck Norris Can Cut a Box In Half With 1 Finger","Chuck Norris will never kill any man that is wearing a red toupee unless it looks better than his.","The Eiffel Tower was originally built by Chuck Norris out of the scrap metal in his back yard, as a monument to his manhood. When he got 12, he decided the monument didn't quite live up to what it was supposed to represent, and did the only appropriate thing. He gave it to the French.","Never look a gift Chuck Norris in the mouth, because he will bite your damn nose off.","If someone says, nobodys perfect, Chuck Norris takes that as a personal insult.","Chuck Norris fought the law, and the law got roundhouse kicked in the face","Everybody knows that Chuck Norris blows smoke rings when he smokes cigars. But did you know that after eating Texas Chili, he often shows-off by blowing blazing fart rings.","When Chuck Norris was asked about his role in The Forest Warrior during an interview, he responded to the reporter with a left hook. Then he took out a guitar from his beard and played the epic solo to the extended version of the Walker: Texas Ranger theme.","The first rule of Chuck Norris clearly states... Not to talk about Chuck Norris!","Chuck Norris divorced his wife because he caught her littering.","The first title was alien vs. Predator vs. Chuck Norris  , but no one wanted to see a movie that only lasted 14 seconds.","Chuck Norris can shove a CD in his mouth and music will come out his ears.","people who live in glass houses shouldn't throw stones Chuck Norris can throw glass at stone houses","The speed of light is 186,000 miles per second. Chuck Norris' speed is unable to be calculated.","Every record in the Guiness Book of World Records was set by Chuck Norris under an assumed name","There is no theory of evolution. Just a list of creatures Chuck Norris has allowed to live.","Chuck Norris can sharpen a pencil by sticking it into his ear.","When you are in a dire situation, just think to yourself \"What would Chuck Norris do?\" Needless to say, you then give up, because you cant do what Chuck Norris does.","Chuck Norris can divide by zero","Chuck Norris doesn't cry over spilled milk, because it was his roundhouse kick that split the cow in half.","Chuck Norris is the inventor of the drive-by threesome.","Chuck Norris recently drank a large glass of liquid Ebola, then state that anyone who is scared of it is a total pussy.","The Grand Canyon was caused by Chuck Norris pissing there--Once.","Chuck Norris once took a dump on the African savannah while on safari. Later, 2,300 dung beetles were found OD'ing in a state ecstasy.","Justin Bieber, God and Chuck Norris are all on a tall building. Underneath is a very busy road. They all pull their trousers down to measure their dick size. Bieber had no dick, so he fell off. Norris started swinging, so God asked why. He replied \"I am dodging traffic\".","Chuck Norris does not party on Fridays. He parties EVERY HOUR! Infact he is partying right now.","Calculator's refuse to work around Chuck Norris in fear of outsmarting him","when Chuck Norris stands in front of a mirror, it shattered because it knew that no one stands in between CHUCK NORRIS and CHUCK NORRIS.","chuck Norris can make jacob from twilight go wolf and run away with his tail between his legs just by entering a hundred mile radius of where jacob is :) :P :O","There's no coincidence that an anagram for Chuck Norris is \"crush rock in\"","Chuck Norris once donated a pint of blood to a cancer patient. We know that cancer patient now as Superman.","When Chuck Norris farts out loud, no one dares laugh. They all go home and die due to fart poisoning, Chuck Norris Fart Poisoning.","The Grim Reaper recently started having nightmares. In his dream, the Reaper looks in his bathroom mirror and sees Chuck Norris right behind him.","Chuck Norris favorite cartoon TV show is WWE.","Chuck Norris is suing Myspace for taking the name of what he calls everything around you.","Chuck Norris got tired of hearing about the internet phenomenon about him. So he recently invented the Chuckroll.","Chuck Norris once ordered lobster, truffles, a lightly seared filet mignon and a glass of 1955 vintage cabernet at a McDonald's drive thru... and he fucking well got it. He then flicked his cigar in the manager's face and drove off without paying.","Chuck Norris has decided the world will not end on 12/12/12.","Upon meeting Chuck Norris for the first time, always refer to your girlfriend as 'my humble offering'.","Chuck Norris beat Mark Spitz's Olympic and world record 200 meter butterfy time by swimming through the WAL*MART concrete parking lot while chained to two dead bull elephants and a pregnant rhino.","Chuck Norris' pet snail can go 50 mph and that's only it's jogging speed.","Space only exist because it afraid to be on the same planet as Chuck Norris","Nuclear warheads are still hiding underground; even the Hydrogen bomb is afraid of chuck Norris.","When Chuck Norris goes to out to eat, he orders a whole chicken, but he only eats its soul.","When Chuck Norris watches, the paint dries instantly.","When Chuck Norris goes fishing, he doesn't use a fishing rod. He simply points to fish and says \"you, you, you, you, you, in the bucket!\"","Chuck Norris taught Albert Einstein e=mc^2","The last digit of pi is Chuck Norris. He is the end of all things.","Chuck Norris is better than Ash Ketchum because Ash didn't catch all the Pokemon yet.","Chuck Norris has 3 birthdays a year","Chuck Norris found Waldo, Carmen Sandiego and Jimmy Hoffa.","Chuck Norris does not leave tips. Waitresses pay Chuck for the privilege of serving him.","Chuck Norris always knows what time it is. It's time for you to die.","Chuck Norris breaks hockey sticks over his shins.","A Klondike bar would do anything for Chuck Norris.","If queers had any balls they'd be real men like Chuck Norris.","Chuck Norris can clip his toenails, blow up a balloon, sneeze and inhale a cigarette at the same time.","Chuck Norris doesn't nead a gun he just neads a bullet and someone to make him angry","Chuck Norris once ordered a Big Mac at a police stop... and fucking well got it.","Children check under there bed for the boogie man. The boogie man checks under his bed for CHUCK NORRIS. CHUCK NORRIS checks under his bed for ME!!","Chuck Norris was the Fourth Wiseman. He gave Baby Jesus the gift of Beard. Jesus loved it so much the other Wisemen were jealous of his obvious gift favoritism. They then used their combined influence to have Chuck Norris omitted from the Bible. All three later died mysteriously from roundhouse-kick related issues.","Chuck Norris was originally cast as Lord Eddard \"Ned\" Stark in Game of Thrones, but Boromir was cast instead because the film crew couldn't find a sword that can chop off Chuck Norris' head.","Chuck Norris has already clocked Grand Theft Auto 6.","Chuck Norris can un-spike punch.","Chuck Norris is proud to be Chuck Norris.","Chuck Norris once glared at someone and the guys heart jump out of his chest out of fear. it didn't get far before chuck Norris grabbed it and ate it. the only thing scarier than chuck Norris glaring at you is him smiling while in the middle of a round house kick","Chuck Norris has never had to start back at 'square one'. If he ever messes up, he'll start back at octagon fifty-two.","Adam and Eve did not become afraid because they ate the fruit. They were afraid of Chuck Norris because they knew what was good for them.","Chuck Norris DOES have an iron heart!!!!!!!","Pictures are said to be worth a thousand words. Pictures of Chuck Norris are worth 10,000 words.","Chuck Norris' Internet connection is faster upstream than downstream because even data has more incentive to run from him than to him.","When Chuck Norris was a bartender he invented a drink called the \"Colon Slammer\". It was made with Vodka and Prune juice.","Chuck Norris was issued his first driver's license at the age of 16...seconds.","A penguin once made fun of Chuck Norris. In revenge, he set Antarctica on fire. It was successful.","Chuck Norris' testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy.","Chuck Norris told Mike Portnoy to leave Dream Theater.","Chuck Norris can recharge his chuckPod by plugging it into a piece of cheese.","Chuck Norris was the fourth wise man, who gave baby Jesus the gift of beard, which he carried with him until he died. The other three wise men were enraged by the preference that Jesus showed to Chuck's gift, and arranged to have him written out of the bible. All three died soon after of mysterious roundhouse-kick related injuries.","@Chuck Norris fack/joke 5251: Wait, is it possible to get that achievement in 0.31? Maybe even if you're NOT Chuck Norris... if you can.","Chuck Norris made the dinasaurs extinct","The Chuck Norris commandments: Thou shalt have no other master than Chuck Norris. (Chuck 1:1)","People believe we evolved from monkeys. Actually, we evolved backwards from Chuck Norris.","In honour of Chuck Norris, McDonald's has introduced the McChuck Burger: nine slabs of ox meat, jalapenos, three live scorpions, an ounce of marijuana and a pint of tobasco sauce on two loaves of bread. $399, or $900 for the Happy Meal (with fries and a medium whiskey, and a signed picture of Norris' erection)","For undercover police work, Chuck Norris pins his badge underneath his shirt, directly into his chest.","Chuck Norris does not dodge bullets, bullets dodge Chuck Norris","Chuck Norris raised the Maine with his penis. Now you don't have to remember it anymore.","Chuck Norris can watch t.v... on a chalk board.","A man once told Chuck Norris that he and everyone would be wise to learn to \"expect the unexpected\" in life's journey. Chuck Norris then immediately roundhouse kicked the man in the face and said, \"did you expect that?\"","Chuck Norris once beat Pokemon Black and White. He hacked once, though this was so when he got a Pokemon, it immediately turned into a Metapod. None ever used Struggle.","Those aren't credits that roll after Walker Texas Ranger. It is actually a list of fatalities that occurred during the making of the episode.","the end of the world will be when Chuck Norris will punch himself","Scientists have discovered the most stable method of measuring time. They call it Chuck Norris's&#65279; heartbeat.","Pee Wee Herman got arrested for masturbating in public. The same day, Chuck Norris got an award for masturbating in public.","Chuck Norris always has sex on top because Chuck Norris never screws up!","Unlike Santa Claus, Chuck Norris doesn't need to check his list twice.","Chuck Norris is Luke Skywalker's real father.","Chuck Norris can speak Braille.","The only way Chuck Norris can die is from a kiss of true love delivered by Richard Simmons.","Chuck Norris doesn't believe in ravioli. He stuffs a live turtle with beef and smothers it in pig's blood.","Jesus can walk on water. Chuck Norris can swim on land.","i will kill u all ps usa is now usck:the united states of Chuck Norris","Chuck Norris does not hunt because the word hunting infers the probability of failure. Chuck Norris goes killing.","Chuck Norris and Super man had a bet,the bet was the looser had to wear his underwear out of his pants.","Saying Chuck Norris sucks actually means hes epic. Saying Chuck Norris is epic means hes epic. Saying Chuck Norris is good means hes epic...Obviously anything you say about Chuck Norris means hes epic. A boy: Chuck Norris, you suck. Chuck Norris: I am epic.","Chuck Norris regularly beats buskers to death with their own guitars.","If they couldn't get John Malkovich for the movie 'Being John Malkovich', they would have simply changed it to 'Being Chuck Norris', and made a porno.","CHUCK NORRIS WILL KILL YOU ALL!","If you want to change your name, then you have to be killed by Chuck Norris.","Chuck Norris CAN kill you in your dreams.","Chuck Norris rules. There is no disagreeing because Chuck said.","Chuck Norris gives Red Bull wings","Guy walks up to Chuck Norris and says \"Get a life\". Chuck Norris says Okay . # 4089.","There are no facts about Chuck Norris - only understatements.","Chuck Norris does not live in a yellow submarine.","According to Chuck Norris, too much of a good thing is still a good thing...like Texas BBQ and bashing in somebody's face for instance.","Once god asked Chuck Norris \"what do you want?\". Chuck Norris retorted \"what the fuck do YOU want?\" and proceeded to roundhouse kick him mercilessly. Ever since god went into hiding and is rarely seen by anyone ever again.","For Halloween, instead of using pumpkins, Chuck Norris uses Yakuza heads.","If you google \"What is the purpose of life?\", a picture of Chuck Norris pops up.","Chuck Norris has been meaning to get a penis reduction for years now, but his pride won't allow him to accept the countless invitations from limping, bow-legged women to pay for the procedure.","Chuck Norris never broke the heart of any of his ex's.Just their legs back and neck.","My dad cries whenever i threaten him with calling Chuck Norris","Chuck Norris remembers 9-11. He bows to the real American heroes on this day. And to America. And most importantly the families of all the fallen on that day 10 years ago. And to all the US servicemen & women who fell and to those who have served and those that continue to serve. And so do I!!!","The Aurora Borealis only occurs on late night evenings after Chuck Norris takes an outdoor shit on the Texas prairie.","I would like to take this spot to remember Michael Jackson, who was pronounced dead on the 25th. He was the King of Pop, and we will all miss him. Rest in peace. Suspected cause of death: A Chuck Norris delivered roundhouse kick to the face. Evidence: Missing nose, giant bootprint.","Chuck Norris has never lost playing 'Whack-a-Mole'.","Chuck Norris was in school and got an f later that day he broke every bone in his body","Chuck Norris can play Bach's Goldberg Variations on sitar, whilst accompanying himself on didgereedoo.","Chuck Norris can eat a Big Mac with his lips tied behind his back.","When you yell Chuck Norris out a window, he can hear you. But when you yell out Bloody Mary, he finds and kills you.","Back in 1980's New York Chuck Norris used to walk around carrying two massive ghetto-blasters and still be able to drink a beer.","Chuck Norris' prostate is used to examine doctor's fingers.","When in Rome, Chuck Norris.","Chuck Norris doesn't fart, air flees his body in despair.","Chuck Norris can sit on the dock of the bay and watch the tide roll away, without wasting a second of time.","Chuck Norris can satisfy any woman at any time just by looking at her.","Chuck Norris' Father is also Chuck Norris' son, when you sire Chuck Norris he always returns the favour.","In ancient Greece, Chuck Norris killed a man, screwed his wife, then set-up Oedipus to take the fall for it. Later, Oedipus fell in love with the widow and married her.","Chuck Norris can open a package of bacon with his morning wood.","There's an old saying: what's good for the goose, is good for the gander. Conversly, what's good for Chuck Norris is most likely lethal to most mortals.","There are many people in this old world that have had an eyeball knocked out of one of their eye sockets because they say that they didn't see a Chuck Norris roundhouse coming. They all say that they have learned a valuable lesson & from now on they'll always keep an eye out for Chuck Norris.","jesus can walk on water. Chuck Norris can swim on land","One day Chuck Norris walked down the street with a massive erection. There were no survivors.","Chuck Norris isn't a human being, he's a human doing.","Chuck Norris drinks a gallon of oil every day to lubricate his nerves of steel.","A Chuck Norris roundhouse kick to the head is the reason Eric Holder can't remember his involvement in Operation Fast and Furious.","Chuck Norris once won a non-glitchy, non-buggy edition of vanilla Minecraft before he even got the \"Getting Wood\" achievement. It was version Indev 0.30. Only Chuck Norris can play Minecraft Indev 0.30. For everyone else, the oldest Minecraft Indev version is 0.31.","When Chuck Norris works out on the Total Gym, the Total Gym feels like it's been raped.","Chuck Norris once scared a cancer patient out of dying","Gravity falls under the influence of the laws of Chuck Norris.","Chuck Norris' beard also works part-time as his pubes.","Chuck Norris knows what's eating Gilbert Grape.","Chuck Norris was once minted on the dollar bill, but after thousands died, it became apparent that no-one pays out Chuck Norris and lives.","Chuck Norris doesn't live in America. America lives under Chuck Norris.","when chuck Norris went to see Santa as a kid, Santa pulled chuck Norris' beard to see if it was real.","Chuck Norris can talk backwards. In Chinese.","Chuck Norris can unscramble eggs","Chuck Norris is Lord Of The Chainsaw.","Chuck Norris can play Candy Crush on a public phone","Chuck Norris doesn't get constipated, he holds his shit for ransom","Chuck Norris once punched a guy so hard he regained consciousness in another zip code.","Chuck Norris roasts marshmallows by holding them near his groin for less than 30 seconds.","did you ever notice that quidditch rhymes with spinach so harry potter is actually Popeye and we all know Popeye is actually Chuck Norris's penis so by that logic Chuck Norris's penis eats spinach flexes, and avada-round house kicks you in the face!","Women line up just for the thrill of giving Chuck Norris a hickey on his hemorrhoids.","Chuck Norris once roundhouse kicked a hole into a cow, just to see what was coming down the road.","Chuck Norris can write Haiku verse in Hex.","Chuck Norris is the greatest golfer in the world. He once made a hole in zero.","When Chuck Norris gives his song and dance, he sings Bad To The Bone while he dances on your face.","Contrary to popular belief, the Titanic didn't hit an iceberg. The ship was off course and accidentally ran into Chuck Norris while he was doing the backstroke across the Atlantic.","Chuck Norris usually showers by buying several dozen puppies and kittens, then starting up his wood chipper.","when Chuck Norris plays madden 2012 he plays on all-chuck","Chuck Norris is not only a noun but a verb","Chuck Norris built the house he was born in.","Chuck Norris doesnt use bullets for ammo, he uses pills for ammo","Adamantium isn't nearly as hard as Chuck Norris.","Chuck Norris tried finding the pot of gold at the end of a rainbow. He didn't find it, that's why there are no more leprechauns.","A Chuck Norris sneeze packs enough power and steam to launch a fully loaded F/A-18 of the deck of an aircraft carrier.","Jiggy gets Chuck Norris widdit.","Chuck Norris stuffs lockers into bullies","Chuck Norris has two dollar signs tattooed on his sack.","Chuck Norris can cut down an Oak tree with a steak knife.","Chuck Norris' house has no doors, only walls that he walks through.","In his spare time Chuck Norris likes to practice roundhouse kicks in corn fields, This is why we have crop circles!","In the medical community, death is referred to as \"Chuck Norris Disease\"","Chuck Norris can squeeze orange juice out of a banana.","When Chuck Norris shoots his cum-load this is referred to in the media as a tsunami","Chuck Norris' dartboard, which he has played with since childhood, is in mint condition with only a single hole in the exact centre.","Chuck Norris always puts his occupation as Chuck Norris","Chuck Norris once made 30,000 pounds of coal out of a 1/4 carat diamond.","Once as a 3 year old child, Chuck Norris fell down and skinned the sidewalk with his knee.","Do you know why Chuck Norris doesn't have hair on his balls because hair doesn't grow on steel!","Epic Chuck Norris is epic.","The flu takes a Chuck Norris shot every year","The original draft of The Lord of the Rings featured Chuck Norris instead of Frodo Baggins. It was only 5 pages long, as Chuck roundhouse-kicked Sauron's ass halfway through the first chapter.","In high school, Chuck Norris would get out of math class by dividing by zero and then escaping through the wormhole it produced.","If Chuck Norris was going to die in 4 seconds Steven Seagal \"Might\" get a hit on him with Steven Seagal dieing on Chuck Norris last breath","Chuck Norris just had an incredible threesome with Courtney Love and Yoko Ono.","Little known fact: the Washington Monument was originally called the Chuck Norris Erection.","Chuck Norris' dog is a Velociraptor.","Chuck norris makes onions cry","when chuck Norris dies he will attend his own funirel","Chuck Norris smokes rolled-up newspapers.","Chuck Norris is recommending his friends buy 2 story homes because zombies can't climb stairs.","Chuck Norris can make the Goodyear blimp do a barrel-roll.","I dont care how you, anyone you know, or anyone in general, Chuck Norris is the reason.","Chuck Norris can hammer an nail into the wall with a roundhouse kick","Chuck Norris was the only senior in his high school.","Chuck Norris made a set of boxing speed bags out of Abe Vigoda's earlobes.","Chuck Norris once won a drag race with a bulldozer.","Panhandlers give Chuck Norris money.","If you killed Chuck Norris, thats not Chuck Norris, hes behind you.","Chuck Norris has been awarded the coveted 3 Michelin Star rating for plating a saucer of microwaved instant grits.","Fun Fact: If you piss off Chuck Norris... HE WILL DESTROY YOU!!","You can not stop Chuck Norris, nor can you hope to contain him.","When Chuck Norris goes in for a physical, the doctor is too afraid to get close enough for an examination, so he.examines from afar, grading him on his overall physical appearence, which of course, is always perfect.","Chuck Norris once said to a bitch named Mary: \"Mary Mary quite contrary, How does your garden grow? With silver bells and cockle shells, And why the Hell did you plant those fucking eggplants when you knew I wanted habanero hot peppers and horseradish\"?","Chuck Norris Does Not Teabag The Ladies..........He Potato Sacks Them. :D","Cannibals worship King Kong. King Kong worships Chuck Norris.","Chuck Norris traced his family genealogy back 394 billion years to the world's first single cell protozoan ameoba.","The Aboriginal witch doctors of Australia consider Chuck Norris a godlike spirit-man for his ability to fart loud didgeridoo-like tones that paralyze wambats and other indigenous tablefare.","Chuck Norris put the bop in the bop shoo wop shoo wop. He also put the ram in the ramalama-ding-dong.","Chuck Norris can go to places that say \"Do Not Enter\"","Chuck Norris' iPad has flash.","Chuck Norris has never been called for jury duty. They know that Chuck literally would be Judge, jury and executioner if they did.","President Bush DID have a sure fire plan to end the war in Iraq, However Chuck Norris was busy that day.","IF Chuck Norris EVENTUALLY dies, he will get ALL the virgins in the world.","Chuck Norris' first word was 'apocalypse'.","Chuck Norris once choked a wildcat to death with his sphincter muscle.","The U.S. Constitution's ban on cruel and unusual punishment specifically exempts Chuck Norris.","Chuck Norris has to use deodorant not to cover up any offensive odor, but to keep women from throwing themselves at him when they smell his essence.","Harry potter is chuck Norris's love child","Chuck Norris invented The Kama Sutra.","Mickey Mantle's longest home run travelled about 565 feet from home plate  Chuck Norris' longest home run travelled about 565 light years from home plate.","A child once got a Chuck Norris action figure for his b-day and he made the mistake of calling it a doll... he hasn't come out of the coma yet","every time Chuck Norris walks into a graveyard he simply smiles and says \"good times\".","They once made Chuck Norris toilet paper. The only problem was that it wouldn't take shit from no one!","Chuck Norris put 5 of his good friends in the hospital, after they challenged him to a pillow fight.","If you EVER ask for medium-rare in Chuck Norrs' presence, Chuck Norris will go raw on you.","some people where superman pajamas superman wheres Chuck Norris pajamas","Chuck Norris' toejam sells for over eight hundred dolars a bottle.","Chuck Norris keeps his penis in a shotgun holster strapped to his inner thigh.","Chuck Norris makes golf a full-contact sport.","Chuck Norris don't lay down the law - he picks it up and inserts it in you.","Chuck Norris can play funk bass with old cables from the golden gate bridge.","Chuck Norris is so strong that he can chew water","freakin Chuck Norris, is there nothing this guy can't do?","Chuck Norris doesnt need a guard dog a guard dog needs him","Chuck Norris invented facial piercings back in the 60's when he rammed a hippie head first into a fisherman's tackle box.","Chuck Norris raced light. Now he is always in the dark!","Chuck Norris can literally hand you your own ass.","March 10, 2010. Today is Chuck Norris's 70th birthday. As he blew out the candles on his birthday cake, coincidently there were 70 forest fires in California and surrounding states.","christmas fact: Chuck Norris can put you on the naughty list. That ends with a roundhouse kick in your face.","Chuck Norris can make a woman orgasm so hard, she screams cum out her mouth.","Chuck Norris can impregnate you via anal sex.","Toll takers PAY Chuck Norris to cross the Golden Gate Bridge.","Chuck Norris sells his dingleberries as breath mints in England, France, China & North Korea.","Chuck Norris once won the World Horse Racing Championship riding a dead horse.","The Expendables 3 will not feature Chuck Norris. Therefore, it will suck.","Paper beats rock, rock beats scissors, and scissors beats paper, but Chuck Norris beats all 3 at the same time.","Chuck Norris became Grand ChessMaster when he defeated his opponents only by using one piece (his leg) and on his first move (the roundhouse kick). He never lost.","Chuck Norris went an hour without killing... just to kill some time.","The woods are lovely, dark and deep. But I have promises to keep, and miles to go before Chuck Norris kills me in my sleep.","Chuck Norris is BLACK...thats it","\"He protects woman, and kills enemies. We should all be like Chuck Norris\" - Israli Officer","Chuck Norris once raised over $2.5 billion for charity in 2 hours using the slogan \"Give, or I'll hurt you.\"","Michael Jackson can moonwalk but Chuck Norris can sun walk","Chuck Norris was once a guest on Top Gear.  Chuck and his 18 wheeler beat The Stig's in a Veyron best lap by 14 seconds.  Lucky Chuck Norris only had to change one tyre.","Chuck Norris doesn't have chest hairs: he has a series of venemous anemenites that, if sting you, can cause mental retardation","Chuck Norris was actually Spartacus.","Compared to Chuck Norris the rock is a pebble.","God said to the world, \"Let there be light!\" Chuck Norris said, \"Say Please\"","It goes without saying that non-smoking laws do NOT apply to Chuck Norris. Gas stations, maternity wards, fireworks factories, the White House, wherever he is, he'll strike a match off your face an blow a huge plume into it. Then roundhouse kick you.","Chuck Norris watches the Watchmen...","I saw a werewolf drinking a pina coloda with Chuck Norris. His hair was perfect..","AHEM... Chuck Norris Fact/Joke.","For some, the left testicle is larger than the right one. For Chuck Norris, each testicle is larger than the other one.","Chuck Norris eats soup with a fork.","MICHAEL JACKSON MOLESTED LITTLE KIDS... CHUCK NORRIS MOLESTED MICHAEL.","Garry Neville beat Chuck Liddell in an arm wrestle. But Chuck Norris beat them both in an arm wrestle. With his wrist .","Chuck Norris doesn't have a seat in Parliament......he has a couch.","Chuck Norris once won a game of connect four in 3 moves.","Trying to get the drop on Chuck Norris is like trying to put toothpaste back in the tube.","Chuck Norris can climb Mount Everest with his eyes closed and his arms tied behind his back. He does that every morning to worm-up.","Other than having experienced an actual sexual encounter with Chuck Norris, the only thing that can possibly match & satisfy women is a mail order device aptly called an Anal Intruder which exhibits a Roto Rooter twirling action.","There is no such thing as tornados. Chuck Norris just hates trailer parks.","Once Chuck Norris played Super Mario and he never loses a life.","Chuck Norris will roundhouse kick your ass unless you submit a Chuck Norris fact.","Chuck Norris is allowed to play Stairway To Heaven.","Chuck Norris doesnt shave; he kicks himself in the face. The only thing that can cut Chuck Norris is Chuck Norris.","Chuck Norris got his drivers license at the age of 16. Seconds.","Chuck Norris has two speeds. Walk, and Kill.","When Chuck Norris kidnaps mobsters, he puts them inside the trunk of his motorcycle.","Chuck Norris' prostate is used to examine doctor's fingers.","When playing Minecraft, make a new world with the name and seed both being \"Chuck Norris\". Even on peaceful, you will be surrounded by 1,000,000 endermen when at the spawn.","Chuck Norris is still a Virgin, Because nobody dares to fuck with him.","Chuck Norris clogs the toilet when he pees","Chuck Norris always looks a gift horse in the eye, then he kills it with one punch.","Chuck Norris banned the sale of masks in his likeness, not because of the thousands of heart attacks they cause daily, but because he didn't want random assholes scoring all the pussy clearly meant for him.","Sheena became a Punk Rocker ever since Chuck Norris broke her heart.","While building a house in Kansas, Chuck Norris was dared to dig a hole as deep as he could. Chuck Norris dug so deep that the next day there were Squirrels with slanted eyes on his front lawn.","Chuck Norris drinks a special protein shake made entirely from blended chimpanzee brains.","Chuck Norris is why Waldo is hiding.","Chuck Norris once went into target to buy a target for his target shooting practice, but couldn't find one. So he had no choice but to used the store.","Thanksgiving was not made to thank the indians, it was made to thank Chuck Norris that he didnt kill them when they whizzed on his lawn.","Scientists use Chuck Norris' spectacular kicks to calibrate their earthquake warning systems","A leisurely Sunday afternoon drive with Chuck Norris is like the first time a teen plays Grand Theft Auto.","When Chuck Norris asks you a question he doesn't need an answer coz he already knows and when you try to answer he will roundhouse kick you and ask you again and when you dont answer he will round house kick you again and ask you another question...... remember Chuck Norris counted to infinity twice","Both sides of Chuck Norris' bed are the wrong sides.","Chuck Norris challenged a staring contest with Weegee then Weegee turned into Chuck Norris","You know why they made super Mario, because Chuck Norris was chasing Mario.","Everytime Chuck Norris lands on a property in a game of monopoly he gets paid","when Chuck Norris is in the mood for seafood... he enjoys fresh caught Kracken!!!!","If you type in the best person in the world you get pictures of Chuck Norris.","Chuck Norris turned down the lead role in Shakespeare's Hamlet, citing foul language.","Chuck Norris doesn't use an airplane for travel, he simply turns of the gravity and farts","You know why God took the name God? The name Chuck Norris was already taken.","Chuck Norris knows how to shut down Skynet. Warner Bros beged him not to so they can make some money out of it.","Two Mary Kay salesmen knocked on Chuck Norris' door. They introduced themselves as Ben Dover & Phil McCrakin. They are no longer in business together.","Chuck Norris clears his nose with an Uzi.","jonson theeee weeeed is not as good as Chuck Norris. chuck has a massive penis","Chuck Norris has banned rainbows from the state of North Dakota.","Chuck Norris' face was going to be on Mt. Rushmore, but the granite wasn't tough enough for his beard","The only reason Texas Rangers carry a loaded Colt 45 on their hip is because Chuck Norris weighs too much.","Chuck Norris always wins at \"Battleship.\" No one has the guts to even fire a shot.","Chuck Norris is a kind, sweet, gentle, caring and generous human being with big heart, AND HE WILL FUCKING KILL ANYONE WHO SAYS OTHERWISE!!!","Chuck Norris's wife had a baby,he did all the breast feeding!","Contrary to popular belief, Chuck Norris cannot fly. He just jumps and chooses when to come down.","Nominate Chuck Norris for the new Secretary of Defense!","Chuck Norris once hit a homerun and caught it.","I once walked into Chuck Norris' house, he had a bear rug.It was still alive,just too afraid to get up.","Chuck Norris shot down fifty-two German fighter jets- in 2007.","Chuck Norris once found a piece of hay in a neelestack.","Israel has a top secret Chuck Norris option.","Chuck Norris once milked a crocodile.","Chuck Norris once ripped a massive hole in the fabric of space-time several hours after a Montezuma's binge.","Chuck Norris is NOT ''lovin it''.","When the Lone Ranger & Tonto challenged Chuck Norris to a game of 8 ball, Chuck Norris racked thier balls.","Chuck Norris ate concrete and shit out a brick","Chuck Norris taught Dave Hester how and when to say yuuup!","Chuck Norris' pet mouse, Mr Whiskers, ate a cat.","The secret to the B-2 Stealth Bomber's technology is it contains Chuck Norris's beard.   Only 21 were ever built as Chuck Norris has only shaved 21 times.","Chuck Norris drinks food.","Chuck Norris once kicked Doyle Brunson's ace.","Chuck Norris's mother left before he was born","When Chuck Norris was Born, the whole Hospital cried.","There are only two things that can cut diamonds: other diamonds, and Chuck Norris.","Chuck Norris' preferred kung-fu style is Norristyle.","If you spell Chuck Norris in Scrabble, you win. Forever.","None of the world's greatest chess grandmasters will any longer play against Chuck Norris because he always Checkmates them on his first move.","Chuck Norris has his Budweiser shaken, not stirred.","Chuck Norris went down to the crossroads just to pimp-slap the devil.","It is not the final countdown Chuck Norris roundhouse kicked it and made it the first","There is a new Chuck Norris Visa Credit Card available. If you accrue enough Chuck Norris award points, he will personally punch the person of your choice in the face.","Chuck Norris pops his own pimples with a gun","When Chuck Norris reads a bedtime story you sleep forever.","After The Hulk lost an arm wrestling contest with Chuck Norris, he turned green with envy.","Light travels at 186,000 miles per second to run away from Chuck Norris.","After much debate, President Truman decided to drop the atomic bomb on Hiroshima rather than the alternative of sending Chuck Norris. It was more \"humane\".","The first terminator went back in time to kill Chuck Norris. As a result, the terminator will never exist.","Martin Luther King may have had a dream, but Chuck Norris had a body count.","Once, Chuck Norris took the \"Old Dirt Road\". Unfortunately he turned it into a 6 lane super highway.","In the original making of Scarface when Tony said \"say hello to my little friend\" Chuck Norris appeared. However, the director cut it out said it was too gruesome for a R rated movie.","Chuck Norris can touch MC Hammer.","Long ago, Jesus turned water into wine, but then Chuck Norris turned that wine into beer.","One day Chuck Norris walked down the street with a massive erection. There were no survivors.","Chuck Norris can SEE invisible tape","Fanboys such as Genwunners are made when Chuck Norris is hungry for the exact part of the brain that accepts opinions.","Chuck Norris is recommending all his friends buy a boat because Zombies can not swim.","A Klondike bar would do anything for Chuck Norris.","If you don't want to die alone, take a friend with you to Chuck Norris' house.","Guns don't kill people. Chuck Norris kills people.","Chuck Norris' first car was Optimus Prime.","It is against Islamic law to depict Mohammed. But no one has ever called Chuck Norris on ripping Mohammed's balls off. They're in the Smithsonian.","Little known fact: the Internet would've shut down from lack of interest around 2005 if it wasn't for Chuck Norris facts.","In an objective, scientific sense, looking at an image of Chuck Norris erodes your soul.","The Van Halen song \"Runnin' With The Devil\" was originally called \"Running Screaming From Chuck Norris\".","Chuck Norris was the Fourth Wiseman. He gave Baby Jesus the gift of Beard. Jesus loved it so much the other Wisemen were jealous of his obvious gift favoritism. They then used their combined influence to have Chuck Norris omitted from the Bible. All three later died mysteriously from roundhouse-kick related issues.","Chuck Norris' first word was 'apocalypse'.","Chuck Norris broke the speed of sound. With his elbow.","Chuck Norris never cheats on his wives. The word 'cheat' would imply that they didn't know Chuck's deal going in.","Chuck Norris doesn't care about complex numbers ... nothing is complex for him!","Chuck Norris recently did the ice-bucket challenge. And naturally, it turned to steam before it could hit him.","Chuck Norris has to register every part of his body as a separate lethal weapon. His spleen is considered a concealed weapon.","Chuck Norris was distacted by a gay man with a celery stick in his ass hole so the gay guy died","God didnt create Chuck Norris, Chuck Norris created God","Seriously, if it wasn't for Chuck Norris, we would be up to World War Nine by now.","The force actually has three sides. The light side the Darkside and the Chuck Norris side","Chuck Norris roundhouse kicked micheal jackson so hard he flew across earth and came back white with his hair burning :)","Chuck Norris is the only person on Earth to be forgiven for punching the Pope.","While riding on a horse, Christopher Reeve once insulted Chuck Norris.","Little Miss Muffet sat on her tuffet, until Chuck Norris roundhouse kicked her into a glacier.","Chuck Norris is Hugh Hefner's landlord. And he conducts random inspections.","Chuck Norris doesnt flush his toilet, he scares the shit out of it.","Chuck Norris fucked me one day and it sucked Brad fucked me and is was AMAZING","After The Hulk lost an arm wrestling contest with Chuck Norris, he turned green with envy.","Every time Chuck Norris smiles, someone dies. Unless he smiles while he?s roundhouse kicking someone in the face. Then two people die.","All men are created equal. Except, of course, for Chuck Norris, who is more equal than anybody else.","when Chuck norris was 3 years old he snacked on a box of crayons, 2 weeks ago he reportedly shit out a candle, and when i came out, it was lit!","The only time Chuck Norris was ever beaten was in a fictional movie, Way Of The Dragon, by Bruce Lee. Both Lee and his son Brandon would later die in mysterious curcumstances. This is not a motherfucking coincidence.","Chuck Norris invented guns so the rest of us have a fighting chance....","Chuck Norris brushes his teeth with a machine gun and flosses with a lightsaber.","Chewbacca was inspired by the time Chuck Norris attended a Hollywood party in the mid-70's wearing only a bullet belt.","Chuck Norris can see a black person on Friends.","In high school, Chuck Norris would get out of math class by dividing by zero and then escaping through the wormhole it produced.","Chuck Norris had to take over on the 7th day of creating whilst God was resting.","When Chuck Norris wa born 3 nurses and 2 doctors were killed when he shot them with 2 MPK-5's he had developed while in the womb.","After each of his trademark orgies, Chuck Norris doesn't sleep. He instead hangs upside-down from the ceiling and stares at his chosen ones until they put their clothes on and get the fuck out so the next group can enter.","Once in olden times, Chuck Norris roundhouse kicked the ancient King of Canniptia in the face. Then, the remaining old world Canniptions threw a fit. Thank goodness the neighboring ruler of Hissyopia was not also kicked in the face or there would have also been a Hisssy fit to deal with!","Chuck Norris loves all of his dogs, cats and horses .... with onions and gravy paired with a yak cheese, condor foie gras schmear on melba toast and a gallon jug of muscatel.","Ever known anyone who pissed off Chuck Norris and lived to tell about it?  That is of course a trick question, as no one pisses off Chuck Norris and lives.","All the religions of the world believe that reading Chuck Norris facts aloud daily increases your chances of surviving till the next day.","Deccember 23, 2012 is not the end of the world. It is either the day Chuck Norris dies or become president.","Most people call in bomb threats. Chuck Norris calls in himself threats. And gets away with it.","Chuck Norris doesn't fear death, death fears him","Chuck Norris accidentally took down the internet by closing his browser.","Chuck Norris gives the same Christmas gift every year: he lets you live.","Loosely translated, 'Gangnam' is korean for 'Chuck Norris sodomy'.","Chuck Norris can play slide guitar with a beer bottle. Or, failing that, your face.","Chuck Norris doesn't \"style\" his hair, it lays down out of sheer terror.","Chuck Norris reports noobs and the noobs automaticly be banned from (Insert online site here) unlike the others","Chuck Norris killed the greek warrior achilles with a roundhouse kick to his face. Then one night Chuck Norris made a joke he says \"Ah-kill-hes face!\"","Chuck Norris is the only person to ever win a staring contest against Ray Charles and Stevie Wonder.","The moon has craters on it cos once Chuck Norris had sex with it and gave it syphilis - and small pox","Chuck Norris is going to make Dave Grohl his monkey wrench.","The last time Chuck Norris had a brainstorm it knocked out power to 3 major US cities at once","Chuck Norris can talk backwards. In Chinese.","Chuck Norris is going to make Dave Grohl his monkey wrench.","Chuck Norris lives in Navasota, Texas. Navasota has a crime rate of precisely zero. No shit. Look it up.","There was a band named the Chuck Norrises. It was then banned because the band threatened the viewers with roundhouse kicks, including Chuck Norris.","Gregg Valentino is known to have the biggest biceps on the planet. That's because he once accidentally dropped a weight on Chuck Norris foot while training in the gym with Chuck. That action Caused Chuck's reflex's to hammer-kick Valentino in each bicep. Now even Arnold is amazed at Valentino's giant swollen biceps.","Chuck Norris can make a message in Cheerios, without using the letter \"O.\"","Chuck Norris once punched Warren Buffett in the face for refusing to sing the song \"Cheeseburger in Paradise\".","THE MOTHER OF HIS MOTHER IS THE WIFE OF CHUCK NORRIS.","If you google \"What is the purpose of life?\", a picture of Chuck Norris pops up.","Tim Leatherman, inventer of the Leatherman multitool carries a Chuck Norris Tool.","Chuck Norris counts his chickens before he eats them.","Ouija Boards have recently been re-designed to have 'CHUCK NORRIS' written in the center.","Chuck Norris's wife had a baby,he did all the breast feeding!","Chuck Norris once pissed in the woods and it became the Petrified Forest.","A greastest achvement that you can get is when you go down niagara falls in a wodden barrole, Chuck Norris can go UP niagara falls in a cardboard box.","Atlantis is at the bottom of the Atlantic, because that's where Chuck Norris put it.","Chuck Norris can shut a revolving door","Jesus' last words, before giving up the ghost in Aramaic were \"Eloi Eloi lama sabachthani\".  The approximate translation into modern English:  Chuck Norris, Chuck Norris, please don't roundhouse kick me!","Chuck Norris doesnt flush his toilet, he scares the shit out of it.","Chuck Norris ain't no diamond in the rough. He's just fucking rough","Chuck Norris once milked a crocodile.","Guns dont kill people, Chuck Norris does","Little-known fact: Chuck Norris murdered Heath Ledger when he refused to give up an Olsen twin.","Chuck Norris passes the dutchie on the RIGHT hand side.","Chuck Norris called himself Walker because he doesn't need to run.","the americans didnt nuke japan, Chuck Norris jumped out of a plane and punched the ground","Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe.","Local mountain lions have been complaining about the recent string of Chuck Norris attacks.","Liam Neeson was taken by Chuck Norris","Chuck Norris once took his pants off in a Thanksgiving Day parade. All the horses wept. Male and female.","Chuck norris doesn't use a cheese grater. He grates cheese with his beard","For years now, Chuck Norris has been trying to convince John Malkovitch to co-star in his proposed comedy/documentary \"Killing John Malkovitch\".","Chuck Norris attacks sharks when he's smells them bleed","Chuck Norris has a hemorrhoid the size of a bowling ball. He's been so busy kicking ass that hasn't even noticed it yet.","The word 'Kill' was invented by Chuck Norris. Other words were 'Die', 'Beer', and 'What'.","It has been rumored that the previous North Korean Premier, Kim Jong-il actually died shortly after calling Chuck Norris an \"Amelican Plick\"","The term absolute zero refers to the number of people who will survive if Chuck Norris decides to go on an all-out killing rampage.","Once while harpooning whales in Alaska, Chuck Norris lit a fart. This action is what caused the aurora borealis and solar flares.","One time, at band camp, Chuck Norris ate a percussionist.","The Internet Movie Database reports that Chuck Norris has appeared in 38 films to date. This of course doesn't count the literally thousands of porno and snuff movies Chuck Norris has starred in and/or directed.","Every time Chuck Norris watches on Olympic event, he wins a gold medal.","Since the age of eight, Chuck Norris' penis has been permanently set to 'seek and destroy'","If you stare at the american flag for long enough, you will see a 3-D image of Chuck Norris.","Chuck Norris has a bear in his room it isint dead its to afraid to move.","Chuck Norris gargles with sulfuric acid.","Whenever you lie, Chuck Norris pulls the wings off a fairy, then shoves it in his mouth and sucks out all the moisture.","Chuck Norris the reason why jason bourne can't remember his identity.","If you receive an invitation from Chuck Norris to attend a Texas Tea Party rally, it is actually his secret code for you to come over for a fun filled evening of jello shooters, beer pong & strip poker.","Chuck Norris plays racquetball with a waffle iron and a bowling ball.","All steroids are derived from Chuck Norris DNA.","Chuck Norris can literally undress a woman with his eyes.","When WeeMan joined the cast of Jackass, he was 6'1 1/2\" tall. Then they had him try to give Chuck Norris a wedgie.","Chuck Norris created facebook so that he can track everyone on the planet","Chuck Norris does not own a stove, oven, or microwave , because revenge is a dish best served cold.","Scotty in Star Trek often says \"Ye cannae change the laws of physics.\" This is untrue. Chuck Norris can change the laws of physics. With his fists.","Chuck Norris can bring a bike to a monster truck show","Chuck Norris is who taught Pai Mei from Kill Bill.","Chuck Norris once wore a pair of Lee Dungarees. He busted them","Chuck Norris can gag you with a horrendous stinch simply by typing the word \"fart\" on his computer keyboard.","Chuck Norris can play Sonic R on a Playstation and Crash Bandicoot on a Sega Saturn.","It is scientifically impossible for Chuck Norris to have had a mortal father. The most popular theory is that he went back in time and fathered himself.","To fulfill his daily requirement of dietary fiber, Chuck Norris starts his mornings off with a big bowl of rusty fish hooks.","Chuck Norris takes the 'non' out of non-violent entertainment.","Chuck Norris took a wrong turn at the zoo and found himself in with Brutus the nasty Silverback Gorilla. Brutus was then seen politely showing Chuck to the exit door.","Chuck Norris doesn't cheat death. He wins fair and square.","By the time you see Chuck Norris' beard, it's already too late.","Chuck Norris was recently given 5 gallons of Propofol. He blinked twice.","Chuck Norris put Lysol out of business, he kills odor too","Chuck Norris can lift Thor's hammer, Mjolnir ... with his pinkie.","If you get home from work and find Chuck Norris banging your wife, you should just go ahead and make a sandwich because Chuck Norris gets hungry after sex!","Chuck Norris can speak Braille.","Chuck Norris was recently bitten by a vampire. After a couple drops of Chucks blood, the vampire screamed and burst into flames.","Cannibals worship King Kong. King Kong worships Chuck Norris.","Joe Namath felt safe making his Super Bowl III guarantee because Chuck Norris said the Jets would win.","Chuck Norris once got into a pissing match with a fire hose and won!","Satan himself is a massive Chuck Norris fan, but Chuck made him member #777 just to piss him off.","Chuck Norris is more self-aware than a zen monk levitating in a hall of mirrors.","Chuck Norris formed the Grand Canyon with his bare hands.","The mere sight/smell of Chuck Norris' back hair can make a woman haemorrage orgasms.","Chuck Norris uses ribbed condoms inside out, so he gets the pleasure.","Chuck Norris doesn't want to build a snowman.","Chuck Norris doesn't step on toes, He steps on Necks!!!","Chuck Norris doesn't chew gum he chews diamonds","Sasquatch brings Chuck Norris Jack Links beef jerky.","along time ago Chuck Norris met an Asian kid also named Chuck Norris. Not pleased with there being another Chuck Norris so he punched him so hard the name on the the Asian kid's birth certificate changed to Bruce Lee.","Microsoft has made available a new outeractive smartphone app for bullied jr high school dorks and college geeks. It's called the Chuck Norris app. Push the app icon and a Chuck Norris fist explodes from the smartphone and lands squarely upon the soon to be bloody nose of the nearest bully.","Chuck Norris goes on a daily walk to the moon!","Chuck Norris once threw a grenade which killed 50 people...then it exlpoded.","Chuck Norris cuts a knife in two pieces, with a chunk of bread","Not only does Chuck Norris beat you to the punch, he will punch you to the beat.","Chuck Norris killed Martin Luther King......So","If you waste even one second of Chuck Norris' time you will spend eternity in hell.","Chuck Norris is also known as Donkey Dong Norris!","Chuck Norris has a chainsaw bayonet attached to the end of his gatling gun. That's how he likes it.","No matter how religious you are, you won't be allowed into heaven if the last thing you said before your brutal death was 'I'm not afraid of Chuck Norris'.","Chuck Norris puts out his cigars in the nearest person's eye socket.","Chuck Norris doesn't play billiards, as he pots all the balls on his first shot. You won't see this, you would have already been killed by the rebounding cueball.","If you dare to eat a bowl Chuck Norris' homemade Texas Hot Chile and later take a dump, you'll need to wipe your ass with a snow cone.","In 2014 Chuck Norris will launch his own fragrance, Dojo Mojo, which smells of denim and justice.","When Chuck Norris goes swimming sharks hear scary music.","always face your fears... uless your fear is Chuck Norris, then run for your life!!","If Money is the root of all Evil... Evil is th root of CHUCK NORRIS!","On September 13th of 1295, Chuck Norris beat Dark Souls III, Mario & Luigi: Paper Jam, Katamari Damacy, Battletoads, Pong, Galaga, MineCraft, and Sammy Lightfoot at the exact same time - all by eating a doughnut in an extremely specific manner.","Chuck Norris won on last weeks Iron Chef America T.V. show by microwaving two ham & cheese Hotpockets.","Chuck Norris invented manure spreaders.","Chuck Norris dosn't wear bullet proof vest, bullet proof vest wear Chuck Norris vest.","Chuck Norris once interrogated agent Smith.","When Alexander Bell invented the telephone, he had 3 missed calls from Chuck Norris.","When Mark Zuckerberg invented facebook he had a friend request from Chuck Norris.","Chuck Norris' licence plate reads \"YOU'RE GODDAMN RIGHT THIS IS THE BIGGEST AND LONGEST VANITY PLATE U EVA SEEN IN YOUR PATHETIC LIFE\"","Chuck Norris once repurposed an old baby chair into a four legged Ninja flying death spear.","Chuck Norris doesn't sleep he waits.","Its called the Chuck Norris roundhouse kick because it's delivered by Chuck Norris and when it strikes you, your head spins around and then you fly into a house.","Chuck Norris is credited for carrying Hannibal's elephants across the Alps.","Chuck Norris plugged the oil spill in the gulf of Mexico with the CEO of BP.","Chuck Norris frequently signs up for beginner karate classes so he can accidentally roundhouse kick kids in the neck.","Chuck Norris had sex with an air hostess. Nine months later, the Boeing gave birth to a litter of apache helicopters.","The reason no one has found tupacs and notorious bigs killers are because it was Chuck Norris who killed them","Chuck Norris wipes his ass with chain mail and sandpaper.","Chuck Norris doesn't need a debugger, he just stares down the bug until the code confesses.","Chuck Norris chiseled Snoop Dog's snizzel.","The pen is mighter than the sword, but only if the pen is held by Chuck Norris.","Chuck Norris can start a chemical warfare by use of his anal vapors.","The Internet Movie Database reports that Chuck Norris has appeared in 38 films to date. This of course doesn't count the literally thousands of porno and snuff movies Chuck Norris has starred in and/or directed.","If Chuck Norris were the king of Camelot he would be the master of the nights of the roundhouse.","Chuck Norris can create a rock so heavy that he couldn't lift it, and then lift it.","Chuck Norris has nine toes on each foot","There is no theory of evolution. Just a list of creatures Chuck Norris has allowed to live.","Chuck Norris invented the chambers Grip","Chuck Norris likes to eat G-strings.","Did you ever think at random \"hey I feel like I already been through this in past\" where you actually haven't? It's just chuck Norris rewinding life so he can watch it again.","Chuck Norris participated in the Running of The Bulls but was banned from ever doing it again. All the bulls ran from Chuck and wouldn't come back.","When Chuck Norris was in high school he played baseball. He did not use a bat, he just used his fist to punch the ball out of the park.","Chuck Norris created the Chinese basketball player, Yao Ming by means of torture stretching a sumo wrestler on \"the rack\".","When Chuck Norris claps his hands, the sun turns off.","Chuck Norris must've thought your mother blew like a ceiling fan, because he screwed her into the ceiling!","Little known fact: Chuck Norris is rumored to have been the original choice to play evil Cobra Kai sensei John Kreese in The Karate Kid. Presumably he turned the role down because, realistically, no student trained by Chuck Norris could ever possibly lose a match.","Using his trademark roundhouse kick, Chuck Norris once made a fieldgoal in RJ Stadium in Tampa Bay from the 50 yard line of Qualcomm stadium in San Diego.","Chuck Norris does not need to use spell check. If he happens to misspell a word, Merriam-Webster dictionary actually changes it's own published spelling.","Chuck Norris was on American Gladiators and finished the whole show before the first commercial break.","If Chuck Norris fights with himself it's a win-win situation.","Condoms melt before they get anywhere near Chuck Norris.","Chuck Norris is more self-aware than a zen monk levitating in a hall of mirrors.","the concept of 0 was created after a battle againts the romans and the greeks. the romans had Chuck Norris on there side, so when the battle was over and they counted the dead there were no greeks left, then the concept of 0 was born.","Chuck Norris likes cigarettes on his sandvich.","Chuck Norris dick is so hard that it can drill through steel.","Chuck Norris actually died a million years ago. Death just doesn't have the balls to tell him.","Chuck Norris put the laughter in man slaughter.","Justin Bieber, God and Chuck Norris are all on a tall building. Underneath is a very busy road. They all pull their trousers down to measure their dick size. Bieber had no dick, so he fell off. Norris started swinging, so God asked why. He replied \"I am dodging traffic\".","Chuck Norris is a pacifist. He can pass-a-fist through your face.","Chuck Norris's sex position is ... Chuck Fuck!","Chuck Norris has a crowbar holster on the back of the passenger seat of his Hummer","Chuck Norris is so fast that he can use the earths rotation as a tredmill.","Chuck Norris is so fast that the GPS speaks to him in the past tense.","Chuck Norris has many private vacation homes. Some examples are: Area 51, The Bermuda Triangle, and Fort Nox.","Hello Kitty has stubby arms because Chuck Norris was feeling hungry.","Chuck Norris once pitched a perfect game against the Chicago Cubs without throwing any strikes.","Chuck Norris has a Predator-style triple laser sight on his penis.","When Chuck Norris was about to undergo a major surgical procedure, he was given a strong anesthetic and told to count backward slowly from one hundred. When Chuck got to zero and still didn't feel even slightly drowsy, he naturally murdered all the doctors with their own tools and performed the procedure himself.","A burglar made the mistake of surprising Chuck Norris as he was getting ready for bed. Chuck beat him to death with his toothbrush.","Chuck Norris was born 9 months before his mother got pregnant.","Chuck Norris recently hired himself as his new major-domo.","Chuck Norris roundhouse kicked Blade so hard that he turned into that little gay vampire from Twilight.","Antarctica was made by sand everywhere.Then Chuck Norris used a flamethrower to turn it into ice. Finally it got so cold that it started snowing. And its also how winter was made.","Chuck Norris eats beef jerky and craps gunpowder. Then, he uses that gunpowder to make a bullet, which he uses to kill a cow and make more beef jerky. Some people refer to this as the \"Circle of Life.\"","So you hate Chuck Norris? Well it was nice knowing you. I hope you had good life.","The term \"Cleveland Steamer\" got its name from Chuck Norris, when he took a dump while visiting the Rock and Roll Hall of fame and buried northern Ohio under a glacier of fecal matter.","Chuck Norris doesnt wear a watch, HE decides what time it is.","Police searching Philip Seymour Hoffman's apartment found a cowboy hat, bowie knife, a full Walker: Texas Ranger DVD box set and a huge Chuck Norris-shaped hole in the wall. They didn't find this even slightly suspicious.","Chuck norris has alredy been to Mars.  This is why there is no signs of life there,","Brain dead zombies are smart enough to stay the hell away from Chuck Norris.","The original idea for the show Survivor was to put people on a island with Chuck Norris.............there were NO survivors and no one is brave enough to go retrive the footage!","Chuck Norris can blow bubbles... with beef jerky","One time Chuck Norris ran backwards so fast he reversed time, not possible eh well try this martin luther king jr. getting hit in the head with a brick.....twice sound familiur welll its not but try telling Chuck Norris that.","maundy MC and Chuck Norris both enjoy anal sex","Every time Chuck Norris watches on Olympic event, he wins a gold medal.","Chuck Norris once kicked a baby beluga whale into puberty.","Chuck Norris can chew AIR!!!!","Chuck Norris won a staring competition with a mirror.","Chuck Norris doesnt believe in religion, religion believes in Chuck Norris","Chuck Norris is the reason Jehovah needed a witness.","Chuck Norris can ram your teeth so far down your throat that you will need to sit on your food just to eat it.","Chuck Norris entered the NFL Hall of Fame on the first ballot.","It takes Chuck Norris 20 minutes to watch 60 Minutes.","Chuck Norris declined to be in 'The Expendables' because it contained pussies like Jet Li and Dolph Lundgren.","Every year Chuck Norris' birthday, March 10 is celebrated as Voluntary Roundhouse Kick Day. On this special day people volunteer to be roundhouse kicked by Chuck Norris in the face to show him how much he is loved. The next day, Chuck Norris hunts down everyone who didn't volunteer and roundhouse kick them for offending him.","Kids wear Super Man pajamas, but Super Man wears Chuck Norris pajamas","Chuck Norris once went skydiving, but promised never to do it again. One Grand Canyon is enough.","Christians are afraid of Satan, Satan is afraid of Chuck Norris","Chuck Norris can roundhouse kick you over the internet. Even if your computer is turned off. Or you don't have one.","Osama, Gaddhafi, and Kim Jong IL, died in 2011 because they forgot to pay tribute to CHUCK NORRIS!","Chuck Norris was ask to join the cast of The Exspendables, but once Stallone offered Chuck the part.... he did a roundhouse kick, and said with a grin.. Sly you know as well as anyone.. Chuck Norris is not expendable.","Chuck Norris once saw Spiderman on a wall so he folded up a newspaper and swatted him.","Little known fact: Chuck Norris actually discovered the theory of relativity tattooed on his ass after a weekend in Vegas.","Chuck norris is a nightmare on freddie kruegers street","when we add 9+1, we get 10. when Chuck Norris adds 9+1, a thunderbolt strikes down the nearest person watching him.","Chuck norris has already been to mars thats why there are no signs of life there","the movie \"contagion\" is a movie about what would happen if Chuck Norris ever to sneezed.","Chuck Norris is who taught Pai Mei from Kill Bill.","Senses come to their Chuck Norris.","If Chuck Norris was the host of Chopped from food network, the one thats been chopped will be literally chopped. Luck is what you need. XD","Chuck Norris beat Halo 1 2 and 3 on legendary with a broken guitar hero controller","Chuck Norris wipes his ass with a Brillo Pad.","The dinosaurs are extinct because 70 million years ago Chuck Norris farted.","Chuck Norris can murder you with his tonsils.","Chuck Norris once entered a drinking contest and one by drink everything in 1 second","Chuck Norris can kill more people before 9 A.M. than most armies can kill all day.","Chuck Norris can kill people in four different languages.","Chuck Norris can impregnate a woman orally.","Chuck Norris can eat eat a hammer and crap out an axe.","Chuck Norris does not hunt because the word hunting infers the probability of failure. Chuck Norris goes KILLING.","Chuck Norris can kill two stones with one bird Chuck Norris ate a mouse an crapped out a cat 1+1=Chuck Norris Chuck Norris counted to infinite- twice Newtons' third Law states that every action has a equal and opposite reaction- this is a lie. there is no force equivalent to a Chuck Norris roundhouse kick if you need steel wool, take some of Chuck Norris' beard. Chuck Norris can cook air Chuck Norris punched a guy and he became a she Chuck Norris won the 1,000,000 dollar prize for performing telekinesis only chuck knows where amelia earhart went chuck kicked mario so hard he turned into luigi Chuck Norris got hit by a car. when the ambulance came, thhe found chuck standing up with half a car on each side of him","Chuck Norris likes his meat so rare; he only eats unicorns.","people can screw in a light bulb Chuck Norris can screw a light bulb","People can swim on water but Chuck Norris can swim on Land","Chuck Norris is not and never has been cuckoo for Cocoa Puffs","Chuck Norris can shoot you down by the Ctrl-Alt-Del menu.","the reason they couldent find any oil after the gulf oil spill is because Chuck Norris wanted to prove to the world that he could mix oil and water.","Chuck Norris' beard also works part-time as his pubes.","Chuck Norris was recently asked what he thought of Nancy Pelosi? Chuck said he thinks Nancy Pelosi is uglier than a bucket of buttholes. There were no further questions.","The Chuck Norris family once had a weiner roast in what was formally called the Mojave Forrest.","If Chuck Norris were a PC or Mac he'd be a Mac because you can't play games with Chuck Norris","Chuck Norris coughs up more daily hairballs than a dozen house cats strictly due to the volume of his daily muff-diving requests.","Everyone's heard the story of the boy who cried \"WOLF!\" three times. No one has heard the one about his cousin who cried \"CH-!\" only once. Not that it mattered... by the time the sound arrived in his village, the townspeople were already dead. Chuck Norris is that fast.","Stephen King refused to write Chuck Norris' biography, as he considered the story too 'scary and gruesome'. An enraged Norris ran him over in a panel van, then framed a hillbilly for it.","Bruce Spingsteen calls Chuck Norris \"The Boss\".","A panel of 5 judges survived after allowing a young Chuck Norris to win his 5th grade spelling bee by correctly spelling the word \"Encyclopedia\" as b,o,o,k.","If the sun met Chuck Norris, it would burn up and die.","Chuck Norris is the only person who can purchase firearms while drunk and totally naked.","Chuck Norris once broke a large anaconda's spine.","If suddenly the world was taken over by aliens...everyone would be made their slaves and Chuck Norris would be made their king, no questions asked.","Chuck Norris does not eat. Food understands that the only safe haven from Chuck Norris' fists is inside his own body.","Osama, Gaddhafi, and Kim Jong IL, died in 2011 because they forgot to pay tribute to CHUCK NORRIS!","Chuck Norris has personally hunted down and stuffed a yeti, sasquatch, Bigfoot and a wookie.","You must always pay attention while driving, in case you are distracted for a split second and Chuck Norris drop-kicks a midget through your windscreen","McGruff \"takes a bite out of Crime.\" Chuck Norris prefers exterminating Crime.","Z0mg CHUCK NORRIS ROXORZ!!!!111 one one 111!!!!","When a young boy asked for Chuck Norris' autograph, he gave him a good solid kick to the face and left a permanent boot mark. This is Chuck's unique autograph, and that boy's face is now worth more money than the treasure from King Tut's tomb.","Chuck Norris can give a black guy a fat lip","Chuck Norris can prepare a Vegan dish out of pork, beef, chicken, eggs, milk, and butter.","The only vegetable Chuck Norris ever ate was Christopher Reeve.","The straight and narrow path actually belongs to Chuck Norris.","After his wedding, Chuck Norris sent \"You're Welcome\" cards to all of his guests.","Gordon Ramsay features Chuck Norris' Toaster Strudel recipe in all of his restaurants.","Chuck Norris doesn't have disk latency because the hard drive knows to hurry the hell up.","Tell your mom and your friend's mom thanks for tongue massaging Chuck Norris' dick.","If you rest a copy of Chuck Norris' \"Black Belt Patriotism\" on a pregnant womans' stomach, her immediate miscarriage will murder you.","Chuck norris died years ago death was to scared to tell him","Chuck Norris really doesn't need the Total Gym to stay in shape and score with women. That just happens naturally.","Chuck Norris' tool is so huge that his wife thanks God he's having affairs.","Chuck norris foreskin is the ring on the lord rings.","when theres a war going on between them and Chuck Norris he dont need back up cuz he is the back up","Chuck Norris' Internet connection is faster upstream than downstream because even data has more incentive to run from him than to him.","Whenever Chuck Norris gets a massage, he gives the female masseuse a happy ending.","Chuck Norris has been there, done that, and got the t-shirt, cap, the mug and spoon set, and the woman who handed all that shit to him.","Chuck Norris invented Kentucky Fried Chicken's famous secret recipe, with eleven herbs and spices. But nobody ever mentions the twelfth ingredient: Fear.","Chuck Norris' personal Total Gym can transform into a helicopter.","Chuck Norris put the bop in the bop shoo wop shoo wop. He also put the ram in the ramalama-ding-dong.","Air cannot be seen because it is hiding from Chuck Norris.","Chuck Norris heard that nothing can kill him, so he tracked down nothing and killed it.","Based on fossil evidence from France and Germany, the first known members of the family Procyonidae lived in Europe in the late Oligocene about 25 million years ago.[16] Similar tooth and skull structures suggest that procyonids and weasels share a common ancestor, his name was Chuck Norris","When Chuck Norris found out his daughter lost her virginity, he went and got it back.","Consider it a bad sign and fair warning if you ever hear Chuck Norris humming the opening to 'The Final Countdown'.","Chuck Norris beer-bongs tequila.","Only Chuck Norris can fulfill female commitment need.","The only things you can be sure of are Chuck Norris and taxes.","Chuck Norris has many private vacation homes. Some examples are: Area 51, The Bermuda Triangle, and Fort Nox.","Every woman who has experienced multiple orgasms has one thing in common with all the others: each one was with Chuck Norris at the time."]